Repository: eternnoir/pyTelegramBotAPI
Catalog: docs/source/locales/*/LC_MESSAGES/async_version.po
Languages: ru

source: Optional lambda function. The lambda receives the message to test as the first parameter. It must return True if the command should handle the message.
ru: Необязательная lambda функция. Получает сообщение (объект Message) в качестве первого параметра. Функция должна вернуть True если хендлер должен обработать сообщение.

source: decorated function
ru: декорируемая функция

source: Handles update in a status of a bot. For private chats, this update is received only when the bot is blocked or unblocked by the user. As a parameter to the decorator function, it passes :class:`telebot.types.ChatMemberUpdated` object.
ru: Обрабатывает изменения статуса бота. Для приватных чатов, этот апдейт отправляется только когда бот был заблокирован или разблокирован пользователем. В качестве параметра передаёт в декорируемую функцию объект :class:`telebot.types.ChatMemberUpdated`.

source: Use this method to pin a message in a supergroup. The bot must be an administrator in the chat for this to work and must have the appropriate admin rights. Returns True on success.
ru: Используйте этот метод, чтобы закрепить сообщение в супергруппе. Бот должен быть администратором чата и иметь соответствующие права администратора. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#pinchatmessage
ru: Документация Telegram: https://core.telegram.org/bots/api#pinchatmessage

source: Identifier of a message to pin
ru: id сообщения, которое нужно закрепить

source: Pass True, if it is not necessary to send a notification to all group members about the new pinned message
ru: Передайте True, если всем участникам группы необходимо отправить уведомление о закреплённом сообщении

source: Handles change of user's answer in a non-anonymous poll(when user changes the vote). Bots receive new votes only in polls that were sent by the bot itself. As a parameter to the decorator function, it passes :class:`telebot.types.PollAnswer` object.
ru: Обрабатывает изменения ответа пользователя в не анонимном опросе(когда пользователь меняет выбор). Боты получают новые ответы только в опросах, которые отправили сами. В качестве параметра передаёт в декорируемую функцию объект :class:`telebot.types.PollAnswer`.

source: Handles new state of a poll. Bots receive only updates about stopped polls and polls, which are sent by the bot As a parameter to the decorator function, it passes :class:`telebot.types.Poll` object.
ru: Обрабатывает изменения в состоянии опроса. Боты получают только апдейты о завершенных опросах и опросах, которые отправили сами. В качестве параметра передаёт в декорируемую функцию объект :class:`telebot.types.Poll`.

source: Runs bot in long-polling mode in a main loop. This allows the bot to retrieve Updates automagically and notify listeners and message handlers accordingly.
ru: Запускает бота в режиме поллинга в основном цикле событий. Это позволяет боту получать апдейты (Update) автоматически и вызывать соответствующие листенеры и хендлеры.

source: Warning: Do not call this function more than once!
ru: Предупреждение: Не вызывайте эту функцию более одного раза!

source: Always gets updates.
ru: Всегда получает апдейты.

source: Set non_stop=True if you want your bot to continue receiving updates if there is an error.
ru: Укажите non_stop=True, если хотите чтобы ваш бот продолжать получать апдейты при возникновении ошибок.

source: Do not stop polling when an ApiException occurs.
ru: Не останавливать поллинг при возникновении ApiException.

source: Delay between two update retrivals
ru: Задержка между получением апдейтов

source: Deprecated, use non_stop. Old typo, kept for backward compatibility.
ru: Устарело, используйте non_stop. Старая опечатка, оставлено для обратной совместимости

source: Restart a file on file(s) change. Defaults to False.
ru: Перезапускать при изменениях в файлах. По умолчанию False.

source: New incoming pre-checkout query. Contains full information about checkout. As a parameter to the decorator function, it passes :class:`telebot.types.PreCheckoutQuery` object.
ru: Новая pre-checkout query. Содержит полную информацию о заказе. В качестве параметра передаёт в декорируемую функцию объект :class:`telebot.types.PreCheckoutQuery`.

source: Process new updates. Just pass list of updates - each update should be instance of Update object.
ru: Обрабатывает новые апдейты. Просто передайте список апдейтов(Update и его наследники).

source: list of updates
ru: список апдейтов

source: Use this method to promote or demote a user in a supergroup or a channel. The bot must be an administrator in the chat for this to work and must have the appropriate admin rights. Pass False for all boolean parameters to demote a user.
ru: Используйте этот метод, чтобы повысить или понизить пользователя в супергруппе или канале. Бот должен быть администратором чата и иметь соответствующие права администратора. Передайте False во все boolean параметры, чтобы понизить пользователя.

source: Telegram documentation: https://core.telegram.org/bots/api#promotechatmember
ru: Документация Telegram: https://core.telegram.org/bots/api#promotechatmember

source: Unique identifier for the target chat or username of the target channel ( in the format @channelusername)
ru: Уникальный id чата или username канала (в формате @channelusername)

source: Pass True, if the administrator can change chat title, photo and other settings
ru: Передайте True, если администратор может менять название чата, аватарку и другие настройки

source: Pass True, if the administrator can create channel posts, channels only
ru: Передайте True, если администратор может создавать посты в канале, только для каналов

source: Pass True, if the administrator can edit messages of other users, channels only
ru: Передайте True, если администратор может изменять сообщения других пользователей, только для каналов

source: Pass True, if the administrator can delete messages of other users
ru: Передайте True, если администратор может удалять сообщения других пользователей

source: Pass True, if the administrator can invite new users to the chat
ru: Передайте True, если администратор может приглашать новых пользователей в чат

source: Pass True, if the administrator can restrict, ban or unban chat members
ru: Передайте True, если администратор может ограничивать, банить или разбанивать участников чата

source: Pass True, if the administrator can pin messages, supergroups only
ru: Передайте True, если администратор может закреплять сообщения, только для супергрупп

source: Pass True, if the administrator can add new administrators with a subset of his own privileges or demote administrators that he has promoted, directly or indirectly (promoted by administrators that were appointed by him)
ru: Передайте True, если администратор может добавлять новых администраторов с подмножеством его собственных прав администратора или понижать администраторов, которых он повысил, напрямую или косвенно (администраторами, которых он назначил)

source: Pass True, if the administrator's presence in the chat is hidden
ru: Передайте True, если присутствие администратора в чате скрыто

source: Pass True, if the administrator can access the chat event log, chat statistics, message statistics in channels, see channel members, see anonymous administrators in supergroups and ignore slow mode. Implied by any other administrator privilege
ru: Передайте True, если администратор имеет доступ к логу событий чата, статистике чата, статистике сообщений в каналах, видеть участников канала, видеть анонимных администраторов в супергруппах и игнорировать медленный режим. Подразумевается любым другим правом администратора

source: Pass True, if the administrator can manage voice chats For now, bots can use this privilege only for passing to other administrators.
ru: Передайте True, если администратор может управлять голосовыми чатами. На текущий момент, боты могут использовать это право администратора только для передачи другим администраторам.

source: Deprecated, use can_manage_video_chats.
ru: Устарело, используйте can_manage_video_chats.

source: Pass True if the user is allowed to create, rename, close, and reopen forum topics, supergroups only
ru: Передайте True, если пользователю разрешено создавать, переименовывать, закрывать, и возобновлять топики, только для супергрупп

source: Registers callback query handler.
ru: Регистрирует хендлер callback query.

source: function to be called
ru: функция-хендлер

source: True if you need to pass TeleBot instance to handler(useful for separating handlers into different files)
ru: True, если вам нужно передать экземпляр класса TeleBot в хендлер(удобно для разбиения кода на файлы)

source: Registers channel post message handler.
ru: Регистрирует хендлер постов в каналах.

source: list of commands
ru: список команд

source: Regular expression
ru: Регулярное выражение

source: Registers chat join request handler.
ru: Регистрирует хендлер запросов на вступление в чат.

source: Registers chat member handler.
ru: Регистрирует хендлер смены состояний участников чата.

source: Registers chosen inline handler.
ru: Регистрирует хендлер выбора результата inline query.

source: Registers edited channel post message handler.
ru: Регистрирует хендлер изменения постов в каналах.

source: Registers edited message handler.
ru: Регистрирует хендлер изменения сообщений.

source: True for private chat
ru: True для приватных чатов

source: Registers inline handler.
ru: Регистрирует хендлер inline query.

source: Registers message handler.
ru: Регистрирует хендлер сообщений.

source: List of chat types
ru: Список видов чатов

source: Registers my chat member handler.
ru: Регистрирует хендлер изменений статуса бота.

source: Registers poll answer handler.
ru: Регистрирует хендлер ответов в опросах.

source: Registers poll handler.
ru: Регистрирует хендлер изменений состояния опросов.

source: Registers pre-checkout request handler.
ru: Регистрирует хендлер pre-checkout query.

source: Registers shipping query handler.
ru: Регистрирует хендлер shipping query.

source: Alternative for delete_webhook but uses set_webhook
ru: Альтернатива delete_webhook, но использует set_webhook

source: Use this method to reopen a closed topic in a forum supergroup chat. The bot must be an administrator in the chat for this to work and must have the can_manage_topics administrator rights, unless it is the creator of the topic. Returns True on success.
ru: Используйте этот метод, чтобы возобновить закрытый топик в супергруппе с топиками. Бот должен быть администратором чата и иметь права администратора can_manage_topics, кроме случаев, когда бот является создателем топика. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#reopenforumtopic
ru: Документация Telegram: https://core.telegram.org/bots/api#reopenforumtopic

source: Identifier of the topic to reopen
ru: id топика для возобновления

source: Use this method to reopen the 'General' topic in a forum supergroup chat. The bot must be an administrator in the chat for this to work and must have can_manage_topics administrator rights. Returns True on success.
ru: Используйте этот метод, чтобы возобновить топик 'General' в супергруппе с топиками. Бот должен быть администратором чата и иметь права администратора can_manage_topics, кроме случаев, когда бот является создателем топика. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#reopengeneralforumtopic
ru: Документация Telegram: https://core.telegram.org/bots/api#reopengeneralforumtopic

source: Convenience function for `send_message(message.chat.id, text, reply_to_message_id=message.message_id, **kwargs)`
ru: Удобная функция для замены `send_message(message.chat.id, text, reply_to_message_id=message.message_id, **kwargs)`

source: Instance of :class:`telebot.types.Message`
ru: Экземпляр класса :class:`telebot.types.Message`

source: Text of the message.
ru: Текст сообщения.

source: Additional keyword arguments which are passed to :meth:`telebot.TeleBot.send_message`
ru: Дополнительные именованные аргументы, передаваемые в :meth:`telebot.TeleBot.send_message`

source: Reset data for a user in chat.
ru: Сбросить данные о пользователе в чате.

source: Use this method to restrict a user in a supergroup. The bot must be an administrator in the supergroup for this to work and must have the appropriate admin rights. Pass True for all boolean parameters to lift restrictions from a user.
ru: Используйте этот метод, чтобы ограничить пользователя в супергруппе. Бот должен быть администратором супергруппы и иметь соответствующие права администратора. Передайте True во все boolean параметры, чтобы снять с пользователя ограничения.

source: Telegram documentation: https://core.telegram.org/bots/api#restrictchatmember
ru: Документация Telegram: https://core.telegram.org/bots/api#restrictchatmember

source: Date when restrictions will be lifted for the user, unix time. If user is restricted for more than 366 days or less than 30 seconds from the current time, they are considered to be restricted forever
ru: Дата, когда ограничения будут сняты с пользователя, UNIX timestamp. Если пользователь ограничен более чем на 366 дней или менее чем на 30 секунд с текущего момента, он будет ограничен навсегда (пока ограничения не будут сняты вручную)

source: Pass True, if the user can send text messages, contacts, locations and venues
ru: Передайте True, если пользователь может отправлять текстовые сообщения, контакты, местоположения и места

source: Pass True, if the user can send audios, documents, photos, videos, video notes and voice notes, implies can_send_messages
ru: Передайте True, если пользователь может отправлять аудио, документы, фото, видео, видео заметки (кружочки) и аудио заметки (голосовые), подразумевает can_send_messages

source: Pass True, if the user is allowed to send polls, implies can_send_messages
ru: Передайте True, если пользователю разрешено отправлять опросы, подразумевает can_send_messages

source: Pass True, if the user can send animations, games, stickers and use inline bots, implies can_send_media_messages
ru: Передайте True, если пользователь может отправлять гифки, игры, стикеры и использовать inline ботов, подразумевает can_send_media_messages

source: Pass True, if the user may add web page previews to their messages, implies can_send_media_messages
ru: Передайте True, если пользователь может добавлять превью ссылок к своим сообщениям, подразумевает can_send_media_messages

source: Pass True, if the user is allowed to change the chat title, photo and other settings. Ignored in public supergroups
ru: Передайте True, если пользователю разрешено изменять название чата, аватарку и другие настройки. Игнорируется в публичных супергруппах

source: Pass True, if the user is allowed to invite new users to the chat, implies can_invite_users
ru: Передайте True, если пользователю разрешено приглашать пользователей в чат

source: Pass True, if the user is allowed to pin messages. Ignored in public supergroups
ru: Передайте True, если пользователю разрешено закреплять сообщения. Игнорируется в публичных супергруппах

source: True on success
ru: True в случае успеха

source: Returns context manager with data for a user in chat.
ru: Возвращает контекстный менеджер с данными о пользователе в чате.

source: Chat's unique identifier, defaults to user_id
ru: Уникальный id чата, по умолчанию user_id

source: Context manager with data for a user in chat
ru: Контекстный менеджер с данными о пользователе в чате.

source: Use this method to revoke an invite link created by the bot. Note: If the primary link is revoked, a new link is automatically generated The bot must be an administrator in the chat for this to work and must have the appropriate admin rights.
ru: Используйте этот метод, чтобы аннулировать ссылку-приглашение, созданную ботом. Примечание: Если аннулируется главная ссылка-приглашение, автоматически генерируется новая. Бот должен быть администратором чата и иметь соответствующие права администратора.

source: Telegram documentation: https://core.telegram.org/bots/api#revokechatinvitelink
ru: Документация Telegram: https://core.telegram.org/bots/api#revokechatinvitelink

source: The invite link to revoke
ru: Ссылка-приглашение, которую нужно аннулировать

source: This class sets webhooks and listens to a given url and port.
ru: Этот класс устанавливает вебхуки и мониторит указанный URL и порт.

source: IP address to listen to. Defaults to 0.0.0.0
ru: IP адрес для мониторинга. По умолчанию 0.0.0.0

source: A port which will be used to listen to webhooks.
ru: Порт, который будет использован для мониторинга вебхуков.

source: Path to the webhook. Defaults to /token
ru: Путь к вебхуку. По умолчанию /token.

source: Path to the certificate file.
ru: Путь к файлу с SSL сертификатом.

source: Path to the certificate key file.
ru: Путь к файлу с приватным ключом SSL сертификата.

source: Webhook URL.
ru: URL вебхука.

source: Maximum allowed number of simultaneous HTTPS connections to the webhook for update delivery, 1-100. Defaults to 40. Use lower values to limit the load on your bot's server, and higher values to increase your bot's throughput.
ru: Максимально-допустимое количество одновременных HTTPS подключений к вебхуку для доставки апдейтов, 1-100. По умолчанию 40. Используйте меньшие значения, чтобы уменьшить нагрузку на ваш сервер и большие значения для увеличения пропускной способности вашего бота.

source: A JSON-serialized list of the update types you want your bot to receive. For example, specify [“message”, “edited_channel_post”, “callback_query”] to only receive updates of these types. See Update for a complete list of available update types. Specify an empty list to receive all updates regardless of type (default). If not specified, the previous setting will be used.
ru: Список видов апдейтов, которые вы хотите получать, в формате JSON. Например, укажите [“message”, “edited_channel_post”, “callback_query”], чтобы получать апдейты только этих видов. Полный список доступных видов апдейтов - util.update_types. Укажите пустой список, чтобы получать все апдейты, кроме chat_member (по умолчанию). Если не задан, будет использована последняя настройка.

source: The fixed IP address which will be used to send webhook requests instead of the IP address resolved through DNS
ru: Фиксированный IP адрес, который будет использоваться для отправки запросов к вебхуку вместо IP адреса, полученного через DNS

source: Pass True to drop all pending updates
ru: Передайте True, чтобы проигнорировать все апдейты, полученные до запуска

source: Integer. Request connection timeout
ru: Integer. Тайм-аут запроса на подключение.

source: Secret token to be used to verify the webhook request.
ru: Секретный токен для верификации запроса к вебхуку.

source: Use this method to send animation files (GIF or H.264/MPEG-4 AVC video without sound). On success, the sent Message is returned. Bots can currently send animation files of up to 50 MB in size, this limit may be changed in the future.
ru: Используйте этот метод, чтобы отправить гифку (GIF или H.264/MPEG-4 AVC видео без звука). В случае успеха, возвращается отправленное сообщение (Message). На текущий момент, боты могут отправлять гифки весом до 50 MB, это ограничение может измениться в будущем.

source: Telegram documentation: https://core.telegram.org/bots/api#sendanimation
ru: Документация Telegram: https://core.telegram.org/bots/api#sendanimation

source: Animation to send. Pass a file_id as String to send an animation that exists on the Telegram servers (recommended), pass an HTTP URL as a String for Telegram to get an animation from the Internet, or upload a new animation using multipart/form-data.
ru: Гиф-ка для отправки. Передайте file_id (String), чтобы отправить гифку, которая уже загружена на сервера Telegram (рекомендуется), передайте HTTP URL (String), чтобы отправить гифку из интернета или загрузите новую гифку с помощью multipart/form-data.

source: Duration of sent animation in seconds
ru: Длительность отправленной гифки в секундах

source: Animation width
ru: Ширина гифки

source: Animation height
ru: Высота гифки

source: Thumbnail of the file sent; can be ignored if thumbnail generation for the file is supported server-side. The thumbnail should be in JPEG format and less than 200 kB in size. A thumbnail's width and height should not exceed 320. Ignored if the file is not uploaded using multipart/form-data. Thumbnails can't be reused and can be only uploaded as a new file, so you can pass “attach://<file_attach_name>” if the thumbnail was uploaded using multipart/form-data under <file_attach_name>.
ru: Обложка отправленного файла; может быть проигнорирована, если генерация обложки поддерживается на стороне сервера. Обложка должна быть картинкой в формате JPEG и весить менее 200 kB. Ширина и высота обложки не должны превышать 320. Игнорируется, если файл не загружен с помощью multipart/form-data. Обложки не могут быть использованы повторно и могут быть загружены только как новый файл, так что вы можете передать “attach://<file_attach_name>” если обложка была загружена с помощью multipart/form-data под именем <file_attach_name>.

source: Animation caption (may also be used when resending animation by file_id), 0-1024 characters after entities parsing
ru: Подпись к гифке (может быть использована при повторной отправке гифки по file_id), 0-1024 символа после форматирования

source: Mode for parsing entities in the animation caption
ru: Режим форматирования подписи к гифке

source: List of special entities that appear in the caption, which can be specified instead of parse_mode
ru: Список отформатированных частей подписи, можно использовать вместо parse_mode

source: Identifier of a message thread, in which the video will be sent
ru: id топика, в который будет отправлено видео

source: Pass True, if the animation should be sent as a spoiler
ru: Передайте True, если гифку нужно отправить как спойлер

source: Use this method to send audio files, if you want Telegram clients to display them in the music player. Your audio must be in the .MP3 or .M4A format. On success, the sent Message is returned. Bots can currently send audio files of up to 50 MB in size, this limit may be changed in the future.
ru: Используйте этот метод, чтобы отправить аудио, если вы хотите, чтобы клиенты (приложения) Telegram проигрывали их в музыкальном проигрывателе. Ваше аудио должно быть в формате .MP3 или .M4A. В случае успеха, возвращается отправленное сообщение (Message). На текущий момент, боты могут отправлять аудио весом до 50 MB, это ограничение может измениться в будущем.

source: For sending voice messages, use the send_voice method instead.
ru: Для отправки голосовых сообщений, используйте метод send_voice

source: Telegram documentation: https://core.telegram.org/bots/api#sendaudio
ru: Документация Telegram: https://core.telegram.org/bots/api#sendaudio

source: Audio file to send. Pass a file_id as String to send an audio file that exists on the Telegram servers (recommended), pass an HTTP URL as a String for Telegram to get an audio file from the Internet, or upload a new one using multipart/form-data. Audio must be in the .MP3 or .M4A format.
ru: Аудио для отправки. Передайте file_id (String), чтобы отправить аудио, которое уже загружено на сервера Telegram (рекомендуется), передайте HTTP URL (String), чтобы отправить аудио из интернета или загрузите новое с помощью multipart/form-data. Аудио должно быть в формате .MP3 или .M4A.

source: Audio caption, 0-1024 characters after entities parsing
ru: Подпись к аудио, 0-1024 символа после форматирования

source: Duration of the audio in seconds
ru: Длительность аудио в секундах

source: Performer
ru: Исполнитель
