Repository: eternnoir/pyTelegramBotAPI
Catalog: docs/source/locales/*/LC_MESSAGES/async_version.po
Languages: ru

source: The maximum distance for proximity alerts about approaching another chat member, in meters. Must be between 1 and 100000 if specified.
ru: Максимальное расстояние для показа уведомлений о приближении других участников чата, в метрах. Если указано, должно быть от 1 до 100000.

source: On success, if the edited message is not an inline message, the edited Message is returned, otherwise True is returned.
ru: В случае успеха, если измененное сообщение не является inline сообщением, возвращается новый объект Message, иначе возвращается True.

source: Use this method to edit animation, audio, document, photo, or video messages. If a message is a part of a message album, then it can be edited only to a photo or a video. Otherwise, message type can be changed arbitrarily. When inline message is edited, new file can't be uploaded. Use previously uploaded file via its file_id or specify a URL.
ru: Используйте этот метод, чтобы изменить гифку, аудио, документ, фото или видео в сообщении. Если сообщение является частью альбома, оно может быть изменено только на фото или видео. Иначе, тип сообщения может быть изменен на любой. При изменении inline сообщения, нельзя загрузить новый файл. используйте ранее загруженные файлы через file_id или укажите URL.

source: Telegram documentation: https://core.telegram.org/bots/api#editmessagemedia
ru: Документация Telegram: https://core.telegram.org/bots/api#editmessagemedia

source: A JSON-serialized object for a new media content of the message
ru: JSON-сериализованный объект нового медиа контента

source: Required if inline_message_id is not specified. Unique identifier for the target chat or username of the target channel (in the format @channelusername)
ru: Обязательный, если не указан inline_message_id. Уникальный id чата или username канала (в формате @channelusername)

source: Required if inline_message_id is not specified. Identifier of the sent message
ru: Обязательный, если не указан inline_message_id. id отправленного сообщения

source: Use this method to edit only the reply markup of messages.
ru: Используйте этот метод, чтобы изменить только reply markup сообщения.

source: Telegram documentation: https://core.telegram.org/bots/api#editmessagereplymarkup
ru: Документация Telegram: https://core.telegram.org/bots/api#editmessagereplymarkup

source: Use this method to edit text and game messages.
ru: Используйте этот метод, чтобы изменить текстовые и игровые сообщения.

source: Telegram documentation: https://core.telegram.org/bots/api#editmessagetext
ru: Документация Telegram: https://core.telegram.org/bots/api#editmessagetext

source: New text of the message, 1-4096 characters after entities parsing
ru: Новый текст сообщения, 1-4096 символов после форматирования

source: Mode for parsing entities in the message text.
ru: Режим форматирования в тексте сообщения.

source: List of special entities that appear in the message text, which can be specified instead of parse_mode
ru: Список отформатированных частей в тексте сообщения, можно использовать вместо parse_mode

source: Disables link previews for links in this message
ru: Отключает превью ссылок в сообщении

source: Handles new version of a channel post that is known to the bot and was edited. As a parameter to the decorator function, it passes :class:`telebot.types.Message` object.
ru: Обрабатывает новую версию поста в канале, который доступен боту и был изменён. В качестве параметра, передаёт в декорируемую функцию объект :class:`telebot.types.Message`.

source: Handles new version of a message that is known to the bot and was edited.
ru: Обрабатывает новую версию сообщения, которое доступно боту и было изменено.

source: As a parameter to the decorator function, it passes :class:`telebot.types.Message` object.
ru: В качестве параметра, передаёт в декорируемую функцию объект :class:`telebot.types.Message`.

source: list of chat types
ru: список видов чатов

source: Enable saving states (by default saving disabled)
ru: Разрешить сохранение стейтов (по умолчанию сохранение отключено)

source: It is recommended to pass a :class:`~telebot.asyncio_storage.StatePickleStorage` instance as state_storage to TeleBot class.
ru: Рекомендуется передавать экземпляр класса :class:`~telebot.storage.StatePickleStorage` в качестве state_storage при инициализации класса TeleBot вместо использования этой функции.

source: Filename of saving file, defaults to "./.state-save/states.pkl"
ru: Имя файла для сохранения, по умолчанию "./.state-save/states.pkl"

source: Use this method to export an invite link to a supergroup or a channel. The bot must be an administrator in the chat for this to work and must have the appropriate admin rights.
ru: Используйте этот метод, чтобы создать или заменить главную ссылку-приглашение в супергруппу или канал, созданную ботом. Бот должен быть администратором чата и иметь соответствующие права администратора.

source: Telegram documentation: https://core.telegram.org/bots/api#exportchatinvitelink
ru: Документация Telegram: https://core.telegram.org/bots/api#exportchatinvitelink

source: exported invite link as String on success.
ru: новая ссылка-приглашение (String) в случае успеха.

source: Use this method to forward messages of any kind.
ru: Используйте этот метод, чтобы переслать любое сообщение.

source: Telegram documentation: https://core.telegram.org/bots/api#forwardmessage
ru: Документация Telegram: https://core.telegram.org/bots/api#forwardmessage

source: Unique identifier for the target message thread (topic) of the forum; for forum supergroups only
ru: Уникальный id топика, в который нужно переслать сообщение; только для супергрупп с топиками

source: On success, the sent Message is returned.
ru: В случае успеха возвращает отправленное сообщение (Message).

source: Use this method to get up to date information about the chat (current name of the user for one-on-one conversations, current username of a user, group or channel, etc.). Returns a Chat object on success.
ru: Используйте этот метод, чтобы получить актуальную информацию о чате (текущее имя пользователя для персональных диалогов, текущий username пользователя, группы или канала и т.д.). В случае успеха возвращает объект Chat.

source: Telegram documentation: https://core.telegram.org/bots/api#getchat
ru: Документация Telegram: https://core.telegram.org/bots/api#getchat

source: Unique identifier for the target chat or username of the target supergroup or channel (in the format @channelusername)
ru: Уникальный id чата или username супергруппы или канала (в формате @channelusername)

source: Chat information
ru: Информация о чате

source: Use this method to get a list of administrators in a chat. On success, returns an Array of ChatMember objects that contains information about all chat administrators except other bots.
ru: Используйте этот метод, чтобы получить список администраторов чата. В случае успеха, возвращает массив объектов ChatMember, содержащих информацию обо всех администраторах чата, кроме других ботов.

source: Telegram documentation: https://core.telegram.org/bots/api#getchatadministrators
ru: Документация Telegram: https://core.telegram.org/bots/api#getchatadministrators

source: List made of ChatMember objects.
ru: Список объектов ChatMember.

source: Use this method to get information about a member of a chat. Returns a ChatMember object on success.
ru: Используйте этот метод, чтобы получить информацию об участнике чата. Возвращает объект ChatMember в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#getchatmember
ru: Документация Telegram: https://core.telegram.org/bots/api#getchatmember

source: Returns ChatMember object on success.
ru: Возвращает объект ChatMember в случае успеха.

source: Use this method to get the number of members in a chat.
ru: Используйте этот метод, чтобы получить количество участников чата.

source: Telegram documentation: https://core.telegram.org/bots/api#getchatmembercount
ru: Документация Telegram: https://core.telegram.org/bots/api#getchatmembercount

source: Number of members in the chat.
ru: Количество участников чата.

source: Use this method to get the current value of the bot's menu button in a private chat, or the default menu button. Returns MenuButton on success.
ru: Используйте этот метод, чтобы получить текущее значение кнопки menu в приватном чате, или кнопку menu по умолчанию. Возвращает MenuButton в случае успеха.

source: Telegram Documentation: https://core.telegram.org/bots/api#getchatmenubutton
ru: Документация Telegram: https://core.telegram.org/bots/api#getchatmenubutton

source: Unique identifier for the target private chat. If not specified, default bot's menu button will be returned.
ru: Уникальный id приватного чата. Если не указан, будет возвращена кнопка menu по умолчанию.

source: Use this method to get information about custom emoji stickers by their identifiers. Returns an Array of Sticker objects.
ru: Используйте этот метод, чтобы получить информацию о кастомных эмодзи по их id. Возвращает массив объектов Sticker.

source: List of custom emoji identifiers. At most 200 custom emoji identifiers can be specified.
ru: Список id кастомных эмодзи. Можно указать не более 200 id.

source: Returns an Array of Sticker objects.
ru: Возвращает массив объектов Sticker.

source: Use this method to get basic info about a file and prepare it for downloading. For the moment, bots can download files of up to 20MB in size. On success, a File object is returned. It is guaranteed that the link will be valid for at least 1 hour. When the link expires, a new one can be requested by calling get_file again.
ru: Используйте этот метод, чтобы получить базовую информацию о файле и подготовить его к скачиванию. На текущий момент, боты могут скачивать файлы весом до 20MB. В случае успеха, возвращается объект File. Гарантируется, что ссылка на скачивание будет актуальна как минимум 1 час. Когда ссылка перестаёт быть актуальной, новая может быть снова запрошена с помощью get_file.

source: Telegram documentation: https://core.telegram.org/bots/api#getfile
ru: Документация Telegram: https://core.telegram.org/bots/api#getfile

source: File identifier
ru: id файла

source: Get a valid URL for downloading a file.
ru: Получить актуальную ссылку для скачивания файла.

source: File identifier to get download URL for.
ru: id файла для получения ссылки на скачивание.

source: URL for downloading the file.
ru: Ссылка для скачивания файла.

source: Use this method to get custom emoji stickers, which can be used as a forum topic icon by any user. Requires no parameters. Returns an Array of Sticker objects.
ru: Используйте этот метод, чтобы получить кастомные эмодзи, которые могут быть использованы любыми пользователями в качестве иконок топиков. Не требует параметров. Возвращает массив объектов Sticker.

source: Telegram documentation: https://core.telegram.org/bots/api#getforumtopiciconstickers
ru: Документация Telegram: https://core.telegram.org/bots/api#getforumtopiciconstickers

source: On success, a list of StickerSet objects is returned.
ru: В случае успеха, возвращается список объектов StickerSet.

source: Use this method to get data for high score tables. Will return the score of the specified user and several of their neighbors in a game. On success, returns an Array of GameHighScore objects.
ru: Используйте этот метод, чтобы получить данные для таблицы рекордов. Вернёт очки указанного пользователя и несколько соседних результатов. В случае успеха, возвращает массив объектов GameHighScore.

source: This method will currently return scores for the target user, plus two of their closest neighbors on each side. Will also return the top three users if the user and their neighbors are not among them. Please note that this behavior is subject to change.
ru: На текущий момент этот метод вернёт очки указанного пользователя и по два соседних результата с каждой стороны. Также вернет результаты трёх лучших игроков, если результат пользователя и соседние не являются тремя лучшими. Пожалуйста учитывайте, что это поведение может быть изменено.

source: Telegram documentation: https://core.telegram.org/bots/api#getgamehighscores
ru: Документация Telegram: https://core.telegram.org/bots/api#getgamehighscores

source: User identifier
ru: id пользователя

source: On success, returns an Array of GameHighScore objects.
ru: В случае успеха, возвращает массив объектов GameHighScore.

source: Returns basic information about the bot in form of a User object.
ru: Возвращает базовую информацию о боте в виде объекта User.

source: Telegram documentation: https://core.telegram.org/bots/api#getme
ru: Документация Telegram: https://core.telegram.org/bots/api#getme

source: Use this method to get the current list of the bot's commands. Returns List of BotCommand on success.
ru: Используйте этот метод, чтобы получить текущий список команд бота. Возвращает список объектов BotCommand в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#getmycommands
ru: Документация Telegram: https://core.telegram.org/bots/api#getmycommands

source: List of BotCommand on success.
ru: Список объектов BotCommand в случае успеха.

source: Use this method to get the current default administrator rights of the bot. Returns ChatAdministratorRights on success.
ru: Используйте этот метод, чтобы получить текущие права администратора для бота по умолчанию. Возвращает объект ChatAdministratorRights в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#getmydefaultadministratorrights
ru: Документация Telegram: https://core.telegram.org/bots/api#getmydefaultadministratorrights

source: Pass True to get the default administrator rights of the bot in channels. Otherwise, the default administrator rights of the bot for groups and supergroups will be returned.
ru: Передайте True, чтобы получить права администратора для бота по умолчанию в каналах. Иначе, будут возвращены права администратора для бота по умолчанию в группах и супергруппах.

source: Returns ChatAdministratorRights on success.
ru: Возвращает объект ChatAdministratorRights в случае успеха.

source: Gets current state of a user. Not recommended to use this method. But it is ok for debugging.
ru: Получает текущее состояние (стейт) пользователя. Не рекомендуется использовать этот метод. Но это удобно для дебага.

source: state of a user
ru: состояние (стейт) пользователя

source: Use this method to get a sticker set. On success, a StickerSet object is returned.
ru: Используйте этот метод, чтобы получить стикерпак. В случае успеха, возвращается объект StickerSet.

source: Telegram documentation: https://core.telegram.org/bots/api#getstickerset
ru: Документация Telegram: https://core.telegram.org/bots/api#getstickerset

source: On success, a StickerSet object is returned.
ru: В случае успеха, возвращается объект StickerSet.

source: Use this method to receive incoming updates using long polling (wiki). An Array of Update objects is returned.
ru: Используйте этот метод, чтобы получить новые апдейты с помощью long polling-а (wiki). Возвращается массив объектов Update.

source: Telegram documentation: https://core.telegram.org/bots/api#getupdates
ru: Документация Telegram: https://core.telegram.org/bots/api#getupdates

source: Identifier of the first update to be returned. Must be greater by one than the highest among the identifiers of previously received updates. By default, updates starting with the earliest unconfirmed update are returned. An update is considered confirmed as soon as getUpdates is called with an offset higher than its update_id. The negative offset can be specified to retrieve updates starting from -offset update from the end of the updates queue. All previous updates will forgotten.
ru: id первого апдейта. Должен быть на единицу больше наибольшего id среди ранее полученных апдейтов. По умолчанию, возвращается список апдейтов, начиная с самого раннего неполученного. Апдейт считается полученным как только вызван метод getUpdates со смещением больше, чем id этого апдейта. Отрицательное смещение может быть указано для получения последних offset апдейтов. Все предыдущие апдейты будут считаться полученными.

source: Limits the number of updates to be retrieved. Values between 1-100 are accepted. Defaults to 100.
ru: Максимальное число апдейтов для получения. Допускаются значения от 1 до 100. По умолчанию 100.

source: Request connection timeout
ru: Тайм-аут запроса

source: Array of string. List the types of updates you want your bot to receive.
ru: Массив строк. Список видов апдейтов, которые вы хотите получать.

source: An Array of Update objects is returned.
ru: Возвращается массив объектов Update.

source: Unique identifier for the target chat or username of the target channel
ru: Уникальный id чата или username канала

source: Use this method to get a list of profile pictures for a user. Returns a :class:`telebot.types.UserProfilePhotos` object.
ru: Используйте этот метод, чтобы получить список аватарок пользователя. Возвращает объект :class:`telebot.types.UserProfilePhotos`.

source: Telegram documentation: https://core.telegram.org/bots/api#getuserprofilephotos
ru: Документация Telegram: https://core.telegram.org/bots/api#getuserprofilephotos

source: Sequential number of the first photo to be returned. By default, all photos are returned.
ru: Порядковый номер первого фото для получения. По умолчанию, возвращаются все фото.

source: Limits the number of photos to be retrieved. Values between 1-100 are accepted. Defaults to 100.
ru: Максимальное число фото для получения. Допускаются значения от 1 до 100. По умолчанию 100.

source: Use this method to get current webhook status. Requires no parameters. On success, returns a WebhookInfo object. If the bot is using getUpdates, will return an object with the url field empty.
ru: Используйте этот метод, чтобы получить текущий статус вебхука. Не требует параметров. В случае успеха возвращает объект WebhookInfo. Если бот использует getUpdates, вернёт объект с пустым атрибутом url.

source: Telegram documentation: https://core.telegram.org/bots/api#getwebhookinfo
ru: Документация Telegram: https://core.telegram.org/bots/api#getwebhookinfo

source: On success, returns a WebhookInfo object.
ru: В случае успеха, возвращает объект WebhookInfo.

source: Use this method to hide the 'General' topic in a forum supergroup chat. The bot must be an administrator in the chat for this to work and must have can_manage_topics administrator rights. Returns True on success.
ru: Используйте этот метод, чтобы удалить топик в супергруппе. Бот должен быть администратором чата и иметь права администратора can_manage_topics, за исключением случае, когда бот является создателем топика. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#hidegeneralforumtopic
ru: Документация Telegram: https://core.telegram.org/bots/api#deleteforumtopic

source: Wrap polling with infinite loop and exception handling to avoid bot stops polling.
ru: Запустить поллинг в бесконечном цикле с обработкой исключений, чтобы избежать непредвиденных остановок поллинга.

source: Install watchdog and psutil before using restart_on_change option.
ru: Установите watchdog и psutil, чтобы использовать restart_on_change.

source: Timeout in seconds for get_updates(Defaults to None)
ru: Тайм-аут get_updates в секундах(по умолчанию None)

source: skip old updates
ru: пропускать старые апдейты

source: Aiohttp's request timeout. Defaults to 5 minutes(aiohttp.ClientTimeout).
ru: Тайм-аут запроса aiohttp. По умолчанию 5 минут(aiohttp.ClientTimeout).

source: Custom logging level for infinity_polling logging. Use logger levels from logging as a value. None/NOTSET = no error logging
ru: Кастомный уровень логирования для infinity_polling. Используйте уровни из logging в качестве значений. None/NOTSET = не логировать ошибки.

source: A list of the update types you want your bot to receive. For example, specify [“message”, “edited_channel_post”, “callback_query”] to only receive updates of these types. See util.update_types for a complete list of available update types. Specify an empty list to receive all update types except chat_member (default). If not specified, the previous setting will be used.
ru: Список видов апдейтов, которые вы хотите получать. Например, укажите [“message”, “edited_channel_post”, “callback_query”], чтобы получать апдейты только этих видов. Полный список доступных видов апдейтов - util.update_types. Укажите пустой список, чтобы получать все апдейты, кроме chat_member (по умолчанию). Если не задан, будет использована последняя настройка.

source: Please note that this parameter doesn't affect updates created before the call to the get_updates, so unwanted updates may be received for a short period of time.
ru: Пожалуйста учитывайте, что этот параметр не влияет на апдейты, отправленные до вызова get_updates, поэтому нежелательные апдейты могут быть получены в течение короткого периода времени.

source: Restart a file on file(s) change. Defaults to False
ru: Перезапуск при изменении файлов. По умолчанию False

source: Path to watch for changes. Defaults to current directory
ru: Путь для мониторинга изменений. По умолчанию текущая директория.

source: Handles new incoming inline query. As a parameter to the decorator function, it passes :class:`telebot.types.InlineQuery` object.
ru: Обрабатывает inline query. В качестве параметра, передаёт в декорируемую функцию объект :class:`telebot.types.InlineQuery`.

source: This function is deprecated. Use `ban_chat_member` instead
ru: Эта функция устарела. Используйте `ban_chat_member`

source: Use this method for your bot to leave a group, supergroup or channel. Returns True on success.
ru: Используйте этот метод, чтобы покинуть группу, супергруппу или канал. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#leavechat
ru: Документация Telegram: https://core.telegram.org/bots/api#leavechat

source: Use this method to log out from the cloud Bot API server before launching the bot locally. You MUST log out the bot before running it locally, otherwise there is no guarantee that the bot will receive updates. After a successful call, you can immediately log in on a local server, but will not be able to log in back to the cloud Bot API server for 10 minutes. Returns True on success.
ru: Используйте этот метод, чтобы отключиться от облачного Bot API сервера перед локальным запуском бота. Вы ДОЛЖНЫ отключить бота перед тем, как запускать его локально, иначе нет никаких гарантий, что бот будет получать апдейты. После успешного вызова, вы можете тут же подключиться к локальному серверу, но не сможете подключиться обратно к облачному Bot API серверу в течение 10 минут. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#logout
ru: Документация Telegram: https://core.telegram.org/bots/api#logout

source: Handles ew incoming message of any kind - text, photo, sticker, etc. As a parameter to the decorator function, it passes :class:`telebot.types.Message` object. All message handlers are tested in the order they were added.
ru: Обрабатывает входящие сообщения всех видов - text, photo, sticker, и т.д. В качестве параметра передаёт в декорируемую функцию объект :class:`telebot.types.Message`. Все хендлеры сообщений проверяются в том порядке, в котором были добавлены.

source: Example:
ru: Пример:

source: Usage of message_handler
ru: Использование message_handler
