Repository: eternnoir/pyTelegramBotAPI
Catalog: docs/source/locales/*/LC_MESSAGES/async_version.po
Languages: ru

source: Video width and height, i.e. diameter of the video message
ru: Ширина и высота видео (диаметр видео сообщения)

source: Identifier of a message thread, in which the video note will be sent
ru: id топика, в который будет отправлена видео заметка

source: Use this method to send audio files, if you want Telegram clients to display the file as a playable voice message. For this to work, your audio must be in an .OGG file encoded with OPUS (other formats may be sent as Audio or Document). On success, the sent Message is returned. Bots can currently send voice messages of up to 50 MB in size, this limit may be changed in the future.
ru: Используйте этот метод, чтобы отправить голосовое сообщение. Ваше аудио должно быть в формате .OGG и закодировано с помощью OPUS (другие форматы можно отправить как Audio или Document). В случае успеха возвращается отправленное сообщение (Message). На текущий момент, боты могут отправлять голосовые сообщения весом до 50 MB, это ограничение может быть изменено в будущем.

source: Telegram documentation: https://core.telegram.org/bots/api#sendvoice
ru: Документация Telegram: https://core.telegram.org/bots/api#sendvoice

source: Audio file to send. Pass a file_id as String to send a file that exists on the Telegram servers (recommended), pass an HTTP URL as a String for Telegram to get a file from the Internet, or upload a new one using multipart/form-data.
ru: Аудио для отправки. Передайте file_id (String), чтобы отправить аудио, которое уже загружено на сервера Telegram (рекомендуется), передайте HTTP URL (String), чтобы отправить аудио из интернета или загрузите новое с помощью multipart/form-data.

source: Voice message caption, 0-1024 characters after entities parsing
ru: Подпись к голосовому сообщению, 0-1024 символа после форматирования

source: Duration of the voice message in seconds
ru: Длительность голосового сообщения в секундах

source: Mode for parsing entities in the voice message caption. See formatting options for more details.
ru: Режим форматирования подписи к голосовому сообщению. См. formatting options для получения подробностей.

source: Use this method to set a custom title for an administrator in a supergroup promoted by the bot. Returns True on success.
ru: Используйте этот метод, чтобы задать кастомное звание администратора супергруппы, повышенного ботом. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#setchatadministratorcustomtitle
ru: Документация Telegram: https://core.telegram.org/bots/api#setchatadministratorcustomtitle

source: New custom title for the administrator; 0-16 characters, emoji are not allowed
ru: Новое кастомное звание администратора; 0-16 символов, эмодзи не разрешены

source: Use this method to change the description of a supergroup or a channel. The bot must be an administrator in the chat for this to work and must have the appropriate admin rights.
ru: Используйте этот метод, чтобы изменить описание супергруппы или канала. Бот должен быть администратором чата и иметь соответствующие права администратора.

source: Telegram documentation: https://core.telegram.org/bots/api#setchatdescription
ru: Документация Telegram: https://core.telegram.org/bots/api#setchatdescription

source: Str: New chat description, 0-255 characters
ru: Str: Новое описание чата, 0-255 символов

source: Use this method to change the bot's menu button in a private chat, or the default menu button. Returns True on success.
ru: Используйте этот метод, чтобы изменить кнопку меню в приватном чате или кнопку меню по умолчанию. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#setchatmenubutton
ru: Документация Telegram: https://core.telegram.org/bots/api#setchatmenubutton

source: Unique identifier for the target private chat. If not specified, default bot's menu button will be changed.
ru: Уникальный id приватного чата. Если не указан, будет изменена кнопка меню по умолчанию.

source: A JSON-serialized object for the new bot's menu button. Defaults to MenuButtonDefault
ru: JSON-сериализованный объект новой кнопки меню. По умолчанию MenuButtonDefault

source: Use this method to set default chat permissions for all members. The bot must be an administrator in the group or a supergroup for this to work and must have the can_restrict_members admin rights.
ru: Используйте этот метод, чтобы задать права по умолчанию для всех участников чата. Бот должен быть администратором группы или супергруппы и иметь права администратора can_restrict_members.

source: Telegram documentation: https://core.telegram.org/bots/api#setchatpermissions
ru: Документация Telegram: https://core.telegram.org/bots/api#setchatpermissions

source: New default chat permissions
ru: Новые права по умолчанию

source: Use this method to set a new profile photo for the chat. Photos can't be changed for private chats. The bot must be an administrator in the chat for this to work and must have the appropriate admin rights. Returns True on success. Note: In regular groups (non-supergroups), this method will only work if the ‘All Members Are Admins’ setting is off in the target group.
ru: Используйте этот метод, чтобы задать новую аватарку чата. В приватных чатах аватарки менять нельзя. Бот должен быть администратором чата и иметь соответствующие права администратора. Возвращает True в случае успеха. Примечание: В обычных группах (не супергруппы), этот метод будет работать только если настройка ‘All Members Are Admins’ отключена.

source: Telegram documentation: https://core.telegram.org/bots/api#setchatphoto
ru: Документация Telegram: https://core.telegram.org/bots/api#setchatphoto

source: InputFile: New chat photo, uploaded using multipart/form-data
ru: InputFile: Новая аватарка чата, загруженная с помощью multipart/form-data

source: Use this method to set a new group sticker set for a supergroup. The bot must be an administrator in the chat for this to work and must have the appropriate administrator rights. Use the field can_set_sticker_set optionally returned in getChat requests to check if the bot can use this method. Returns True on success.
ru: Используйте этот метод, чтобы задать стикерпак супергруппы. Бот должен быть администратором чата и иметь соответствующие права администратора. Используйте атрибут can_set_sticker_set, возвращаемые методом getChat, чтобы проверить, что бот может использовать этот метод. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#setchatstickerset
ru: Документация Telegram: https://core.telegram.org/bots/api#setchatstickerset

source: Name of the sticker set to be set as the group sticker set
ru: Имя стикерпака для установки в качестве стикерпака группы

source: StickerSet object
ru: Объект StickerSet

source: Use this method to change the title of a chat. Titles can't be changed for private chats. The bot must be an administrator in the chat for this to work and must have the appropriate admin rights. Returns True on success. Note: In regular groups (non-supergroups), this method will only work if the ‘All Members Are Admins’ setting is off in the target group.
ru: Используйте этот метод, чтобы изменить название чата. В приватных чатах изменить название нельзя. Бот должен быть администратором чата и иметь соответствующие права админа. Возвращает True в случае успеха. Примечание: В обычных группах (не супергруппы), этот метод будет работать только если настройка ‘All Members Are Admins’ отключена.

source: Telegram documentation: https://core.telegram.org/bots/api#setchattitle
ru: Документация Telegram: https://core.telegram.org/bots/api#setchattitle

source: New chat title, 1-255 characters
ru: Новое название чата, 1-255 символов

source: Sets the value of points in the game to a specific user.
ru: Задаёт количество очков пользователя в игре.

source: Telegram documentation: https://core.telegram.org/bots/api#setgamescore
ru: Документация Telegram: https://core.telegram.org/bots/api#setgamescore

source: New score, must be non-negative
ru: Количество очков, должно быть неотрицательным

source: Pass True, if the high score is allowed to decrease. This can be useful when fixing mistakes or banning cheaters
ru: Передайте True, если количество очков могут быть уменьшено. Может быть полезно при исправлении ошибок или бане читеров

source: Pass True, if the game message should not be automatically edited to include the current scoreboard
ru: Передайте True, если сообщение с игрой должно быть автоматически отредактировано, чтобы отобразить новый результат

source: On success, if the message was sent by the bot, returns the edited Message, otherwise returns True.
ru: В случае успеха, если сообщение было отправлено ботом, возвращает измененное сообщение (Message), иначе возвращает True.

source: Use this method to change the list of the bot's commands.
ru: Используйте этот метод, чтобы изменить список команд бота.

source: Telegram documentation: https://core.telegram.org/bots/api#setmycommands
ru: Документация Telegram: https://core.telegram.org/bots/api#setmycommands

source: List of BotCommand. At most 100 commands can be specified.
ru: Список объектов BotCommand. Можно задать не более 100 команд.

source: Use this method to change the default administrator rights requested by the bot when it's added as an administrator to groups or channels. These rights will be suggested to users, but they are are free to modify the list before adding the bot. Returns True on success.
ru: Используйте этот метод, чтобы изменить права администратора по умолчанию, запрашиваемые при добавлении бота в группу или канал в качестве администратора. Эти права будут предложены пользователям, но пользователи могут изменить список перед добавлением бота. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#setmydefaultadministratorrights
ru: Документация Telegram: https://core.telegram.org/bots/api#setmydefaultadministratorrights

source: A JSON-serialized object describing new default administrator rights. If not specified, the default administrator rights will be cleared.
ru: JSON-сериалиованный объект, описывающий новые права администратора по умолчанию. Если не указан, права администратора по умолчанию будут сброшены.

source: Pass True to change the default administrator rights of the bot in channels. Otherwise, the default administrator rights of the bot for groups and supergroups will be changed.
ru: Передайте True, чтобы изменить права администратора по умолчанию в каналах. Иначе, будут изменены права администратора по умолчанию для групп и супергрупп.

source: Sets a new state of a user.
ru: Задаёт новое состояние (стейт) пользователя.

source: You should set both user id and chat id in order to set state for a user in a chat. Otherwise, if you only set user_id, chat_id will equal to user_id, this means that state will be set for the user in his private chat with a bot.
ru: Вы должны указать и user id и chat id, чтобы задать состояние (стейт) пользователя в чате. Иначе, если вы укажете только user_id, chat_id будет равен user_id, что означает смену состояния (стейта) пользователя в его приватном чате с ботом.

source: new state. can be string, integer, or :class:`telebot.types.State`
ru: новое состояние (стейт). может быть строкой, числом или :class:`telebot.types.State`

source: Use this method to move a sticker in a set created by the bot to a specific position . Returns True on success.
ru: Используйте этот метод, чтобы передвинуть стикер в стикерпаке, созданном ботом, на заданную позицию. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#setstickerpositioninset
ru: Документация Telegram: https://core.telegram.org/bots/api#setstickerpositioninset

source: New sticker position in the set, zero-based
ru: Новая позиция стикера в стикерпаке, начиная с нуля

source: Use this method to set the thumbnail of a sticker set. Animated thumbnails can be set for animated sticker sets only. Returns True on success.
ru: Используйте этот метод, чтобы задать обложку стикерпака. Анимированные обложки могут быть заданы только для анимированных стикерпаков. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#setstickersetthumb
ru: Документация Telegram: https://core.telegram.org/bots/api#setstickersetthumb

source: Update listener is a function that gets any update.
ru: Задаёт функцию-листенер, которая будет вызвана при получении нового апдейта.

source: function that should get update.
ru: Функция-листенер.

source: Example on asynchronous update listeners.
ru: Пример асинхронного листенера апдейтов.

source: Use this method to specify a URL and receive incoming updates via an outgoing webhook. Whenever there is an update for the bot, we will send an HTTPS POST request to the specified URL, containing a JSON-serialized Update. In case of an unsuccessful request, we will give up after a reasonable amount of attempts. Returns True on success.
ru: Используйте этот метод, чтобы задать URL и получать входящие апдейты с помощью вебхука. Как только у бота появляется апдейт, он будет отправлен с помощью HTTPS POST запроса на заданный URL, содержащего JSON-сериализованный Update. В случае неудачного запроса, отправка апдейта будет отменена после разумного числа попыток. Возвращает True в случае успеха.

source: If you'd like to make sure that the webhook was set by you, you can specify secret data in the parameter secret_token. If specified, the request will contain a header “X-Telegram-Bot-Api-Secret-Token” with the secret token as content.
ru: Если вы хотите удостовериться, что вебхук был задан вами, вы можете задать секретный токен в параметре secret_token. Если указан, запрос с апдейтом будет содержать хедер “X-Telegram-Bot-Api-Secret-Token” с секретным токеном в качестве значения.

source: Telegram Documentation: https://core.telegram.org/bots/api#setwebhook
ru: Документация Telegram: https://core.telegram.org/bots/api#setwebhook

source: HTTPS URL to send updates to. Use an empty string to remove webhook integration, defaults to None
ru: HTTPS URL для отправки апдейтов. Используйте пустую строку, чтобы удалить вебхук, по умолчанию None

source: Upload your public key certificate so that the root certificate in use can be checked, defaults to None
ru: Загрузите публичный ключ вашего SSL сертификата, чтобы корневой сертификат мог быть проверен, по умолчанию None

source: The maximum allowed number of simultaneous HTTPS connections to the webhook for update delivery, 1-100. Defaults to 40. Use lower values to limit the load on your bot's server, and higher values to increase your bot's throughput, defaults to None
ru: Максимально-допустимое количество одновременных HTTPS соединений для доставки апдейтов, 1-100. По умолчанию 40. Используйте меньшие значения для уменьшения нагрузки на ваш сервер и большие значения, чтобы увеличить пропускную способность вашего бота, по умолчанию None

source: A JSON-serialized list of the update types you want your bot to receive. For example, specify [“message”, “edited_channel_post”, “callback_query”] to only receive updates of these types. See Update for a complete list of available update types. Specify an empty list to receive all update types except chat_member (default). If not specified, the previous setting will be used. Please note that this parameter doesn't affect updates created before the call to the setWebhook, so unwanted updates may be received for a short period of time. Defaults to None
ru: Список видов апдейтов, которые вы хотите получать, в формате JSON. Например, укажите [“message”, “edited_channel_post”, “callback_query”], чтобы получать апдейты только этих видов. Полный список доступных видов апдейтов - util.update_types. Укажите пустой список, чтобы получать все апдейты, кроме chat_member (по умолчанию). Если не задан, будет использована последняя настройка. Пожалуйста учтите, чтобы этот параметр не влияет на апдейты, отправленные до вызова setWebhooks, поэтому нежелательные апдейты могут быть получены в течение короткого периода времени. По умолчанию None

source: A JSON-serialized list of the update types you want your bot to receive. For example, specify [“message”, “edited_channel_post”, “callback_query”] to only receive updates of these types. See Update for a complete list of available update types. Specify an empty list to receive all update types except chat_member (default). If not specified, the previous setting will be used.
ru: Список видов апдейтов, которые вы хотите получать, в формате JSON. Например, укажите [“message”, “edited_channel_post”, “callback_query”], чтобы получать апдейты только этих видов. Полный список доступных видов апдейтов - util.update_types. Укажите пустой список, чтобы получать все апдейты, кроме chat_member (по умолчанию). Если не задан, будет использована последняя настройка.

source: Please note that this parameter doesn't affect updates created before the call to the setWebhook, so unwanted updates may be received for a short period of time. Defaults to None
ru: Пожалуйста учтите, чтобы этот параметр не влияет на апдейты, отправленные до вызова setWebhooks, поэтому нежелательные апдейты могут быть получены в течение короткого периода времени. По умолчанию None

source: The fixed IP address which will be used to send webhook requests instead of the IP address resolved through DNS, defaults to None
ru: Фиксированный IP адрес, который будет использоваться для отправки запросов к вебхукувместо IP адреса, полученного с через DNS, по умолчанию None

source: A secret token to be sent in a header “X-Telegram-Bot-Api-Secret-Token” in every webhook request, 1-256 characters. Only characters A-Z, a-z, 0-9, _ and - are allowed. The header is useful to ensure that the request comes from a webhook set by you. Defaults to None
ru: Секретный токен для отправки в хедере “X-Telegram-Bot-Api-Secret-Token” в каждом запросе с апдейтом, 1-256 символов. Разрешены только символы A-Z, a-z, 0-9, _ и -. Хедер полезен для, того чтобы удостовериться, что запрос приходитс вебхука, установленного вами. По умолчанию None

source: :obj:`bool` if the request was successful.
ru: :obj:`bool` если запрос был успешным.

source: Setup middleware.
ru: Настраивает middleware

source: Take a look at the :class:`telebot.asyncio_handler_backends.BaseMiddleware` section for more.
ru: Взгляните на секцию :class:`telebot.asyncio_handler_backends.BaseMiddleware` для получения подробностей.

source: Middleware-class.
ru: Класс-Middleware.

source: Handles new incoming shipping query. Only for invoices with flexible price. As a parameter to the decorator function, it passes :class:`telebot.types.ShippingQuery` object.
ru: Обрабатывает shipping query. Только для инвойсов с гибкой ценой. В качестве параметра передаёт в декорируемую функцию объект :class:`telebot.types.ShippingQuery`.

source: Skip existing updates. Only last update will remain on server.
ru: Пропускает существующие апдейты. На сервере останется только последний апдейт.

source: Use this method to stop updating a live location message before live_period expires. On success, if the message is not an inline message, the edited Message is returned, otherwise True is returned.
ru: Используйте этот метод, чтобы остановить обновление live местоположения до истечения live_period. В случае успеха, если сообщение не является inline сообщением,возвращается измененное сообщение (Message), иначе возвращается True.

source: Telegram documentation: https://core.telegram.org/bots/api#stopmessagelivelocation
ru: Документация Telegram: https://core.telegram.org/bots/api#stopmessagelivelocation

source: Required if inline_message_id is not specified. Identifier of the message with live location to stop
ru: Обязательный, если не указан inline_message_id. id сообщения live местоположением, которое нужно остановить

source: Required if chat_id and message_id are not specified. Identifier of the inline message with live location to stop
ru: Обязательный, если не указаны chat_id и message_id. id inline сообщения с live местоположением, которое нужно остановить

source: On success, if the message is not an inline message, the edited Message is returned, otherwise True is returned.
ru: В случае успеха, если сообщение не является inline сообщением, возвращается измененное сообщение (Message), иначе возвращается True.

source: Use this method to stop a poll which was sent by the bot. On success, the stopped Poll is returned.
ru: Используйте этот метод, чтобы завершить опрос, отправленный ботом. В случае успеха возвращается завершенный опрос (Poll).

source: Telegram documentation: https://core.telegram.org/bots/api#stoppoll
ru: Документация Telegram: https://core.telegram.org/bots/api#stoppoll

source: Identifier of the original message with the poll
ru: id сообщения с опросом

source: A JSON-serialized object for a new message markup.
ru: JSON-сериализованный объект новой inline клавиатуры.

source: On success, the stopped Poll is returned.
ru: В случае успеха возвращается завершенный опрос (Poll).

source: Use this method to unban a previously kicked user in a supergroup or channel. The user will not return to the group or channel automatically, but will be able to join via link, etc. The bot must be an administrator for this to work. By default, this method guarantees that after the call the user is not a member of the chat, but will be able to join it. So if the user is a member of the chat they will also be removed from the chat. If you don't want this, use the parameter only_if_banned.
ru: Используйте этот метод, чтобы разбанить ранее кикнутого пользователя в супергруппе или канале. Пользовать не вернется в группу или канал автоматически, но сможет присоединиться с помощью ссылки и т.д. Бот должен быть администратором. По умолчанию, этот метод гарантирует, что после вызова, пользователь не является участником чата, но может присоединиться. Поэтому если пользовать является участником чата, он будет кикнут, но не забанен. Если вы хотите изменить это поведение, используйте параметр only_if_banned.

source: Telegram documentation: https://core.telegram.org/bots/api#unbanchatmember
ru: Документация Telegram: https://core.telegram.org/bots/api#unbanchatmember

source: Unique identifier for the target group or username of the target supergroup or channel (in the format @username)
ru: Уникальный id группы или username супергруппы или канала (в формате @username)

source: Do nothing if the user is not banned
ru: Ничего не делать, если пользователь не забанен

source: Use this method to unban a previously banned channel chat in a supergroup or channel. The bot must be an administrator for this to work and must have the appropriate administrator rights. Returns True on success.
ru: Используйте этот метод, чтобы разбанить ране забаненный канал в супергруппе или канала. Бот должен быть администратором и иметь соответствующие права администратора. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#unbanchatsenderchat
ru: Документация Telegram: https://core.telegram.org/bots/api#unbanchatsenderchat

source: Unique identifier of the target sender chat.
ru: Уникальный id чата.

source: Use this method to unhide the 'General' topic in a forum supergroup chat. The bot must be an administrator in the chat for this to work and must have can_manage_topics administrator rights. Returns True on success.
ru: Используйте этот метод, чтобы сделать топик 'General' видимым в супергруппе с топиками. Бот должен быть администратором чата и иметь права администратора can_manage_topics. Возвращает True в случае успеха.
