Repository: eternnoir/pyTelegramBotAPI
Catalog: docs/source/locales/*/LC_MESSAGES/async_version.po
Languages: ru

source: Telegram documentation: https://core.telegram.org/bots/api#unhidegeneralforumtopic
ru: Документация Telegram: https://core.telegram.org/bots/api#unhidegeneralforumtopic

source: Use this method to unpin a all pinned messages in a supergroup chat. The bot must be an administrator in the chat for this to work and must have the appropriate admin rights. Returns True on success.
ru: Используйте этот метод, что открепить все закрепленные сообщения в супергруппе. Бот должен быть администратором чата и иметь соответствующие права администратора. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#unpinallchatmessages
ru: Документация Telegram: https://core.telegram.org/bots/api#unpinallchatmessages

source: Use this method to clear the list of pinned messages in a forum topic. The bot must be an administrator in the chat for this to work and must have the can_pin_messages administrator right in the supergroup. Returns True on success.
ru: Используйте этот метод, что открепить все закрепленные сообщения в топике. Бот должен быть администратором чата и иметь права администратора can_pin_messages в супергруппе. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#unpinallforumtopicmessages
ru: Документация Telegram: https://core.telegram.org/bots/api#unpinallforumtopicmessages

source: Identifier of the topic
ru: id топика

source: Use this method to unpin specific pinned message in a supergroup chat. The bot must be an administrator in the chat for this to work and must have the appropriate admin rights. Returns True on success.
ru: Используйте этот метод, что открепить закрепленное сообщение в супергруппе. Бот должен быть администратором чата и иметь соответствующие права администратора. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#unpinchatmessage
ru: Документация Telegram: https://core.telegram.org/bots/api#unpinchatmessage

source: Int: Identifier of a message to unpin
ru: Int: id сообщения, которое нужно открепить

source: Use this method to upload a .png file with a sticker for later use in createNewStickerSet and addStickerToSet methods (can be used multiple times). Returns the uploaded File on success.
ru: Используйте этот метод, чтобы загрузить .png стикер, чтобы позже использовать в методах createNewStickerSet и addStickerToSet (может быть использован несколько раз). Возвращает загруженный файл (File) в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#uploadstickerfile
ru: Документация Telegram: https://core.telegram.org/bots/api#uploadstickerfile

source: User identifier of sticker set owner
ru: id пользователя, создавшего стикерпак

source: On success, the sent file is returned.
ru: В случае успеха возвращается отправленный файл.

source: Class for handling exceptions while Polling
ru: Класс для обработки исключений во время поллинга

source: Class for (next step|reply) handlers
ru: Класс для (next step|reply) хендлеров

source: Asyncio filters
ru: Файл asyncio_filters

source: Bases: :py:class:`abc.ABC`
ru: Базовые классы: :py:class:`abc.ABC`

source: Advanced Custom Filter base class. Create child class with check() method. Accepts two parameters, returns bool: True - filter passed, False - filter failed. message: Message class text: Filter value given in handler
ru: Базовый класс Advanced Custom Filter. Создайте класс наследник с методом check(). Принимает два параметра, возвращает bool: True - фильтр пройден, False - фильтр не пройден. message: класс Message text: значение фильтра, полученное в хендлере

source: Child classes should have .key property.
ru: Классы наследники должны иметь статический атрибут (property) .key

source: Example on creating an advanced custom filter.
ru: Пример создания advanced custom filter.

source: Perform a check.
ru: Выполнить проверку.

source: Bases: :py:class:`telebot.asyncio_filters.AdvancedCustomFilter`
ru: Базовые классы: :py:class:`telebot.custom_filters.AdvancedCustomFilter`

source: Check whether chat_id corresponds to given chat_id.
ru: Проверяет, является ли chat_id заданным.

source: Example on using this filter:
ru: Пример использования этого фильтра:

source: Bases: :py:class:`telebot.asyncio_filters.SimpleCustomFilter`
ru: Базовые классы: :py:class:`telebot.asyncio_filters.SimpleCustomFilter`

source: Check whether message was forwarded from channel or group.
ru: Проверяет, является ли сообщение пересланным из канала или группы.

source: Check whether the user is administrator / owner of the chat.
ru: Проверяет, является ли пользователь администратором / владельцем чата.

source: Filter to check whether the string is made up of only digits.
ru: Фильтр для проверки, состоит ли строка только из цифр.

source: Check whether message is a reply.
ru: Проверяет, является ли сообщение ответом (reply).

source: Check users language_code.
ru: Проверяет language_code пользователя.

source: Simple Custom Filter base class. Create child class with check() method. Accepts only message, returns bool value, that is compared with given in handler.
ru: Базовый класс Simple Custom Filter. Создайте класс наследник с методом check(). Принимает только сообщение, возвращает bool, который сравнивается с заданным в хендлере.

source: Example on creating a simple custom filter.
ru: Пример создания simple custom filter.

source: Filter to check state.
ru: Фильтр для проверки состояния (стейта).

source: Filter to check Text message. key: text
ru: Фильтр для проверки текста сообщения. key: text

source: Advanced text filter to check (types.Message, types.CallbackQuery, types.InlineQuery, types.Poll)
ru: Advanced текстовый фильтр для проверки (types.Message, types.CallbackQuery, types.InlineQuery, types.Poll)

source: example of usage is in examples/asynchronous_telebot/custom_filters/advanced_text_filter.py
ru: пример использования в examples/asynchronous_telebot/custom_filters/advanced_text_filter.py

source: string, True if object's text is equal to passed string
ru: строка, True если текст объекта идентичен заданной строке

source: list[str] or tuple[str], True if any string element of iterable is in text
ru: list[str] или tuple[str], True если хотя бы один из элементов есть в тексте

source: string, True if object's text starts with passed string
ru: string, True если текст объекта начинается с заданной строки

source: bool (default False), case insensitive
ru: bool (по умолчанию False), независимый от регистра

source: if incorrect value for a parameter was supplied
ru: если было задано некорректное значение параметра

source: Filter to check Text message.
ru: Фильтр для проверки текста сообщения.

source: Filter to check whether message starts with some text.
ru: Фильтр для проверки, начинается ли сообщение с заданного текста.

source: Asyncio handler backends
ru: Файл asyncio_handler_backends

source: File with all middleware classes, states.
ru: Файл со всеми классами middleware и states.

source: Base class for middleware. Your middlewares should be inherited from this class.
ru: Базовый класс для middleware. Ваши middleware должны быть унаследованы от этого класса.

source: Set update_sensitive=True if you want to get different updates on different functions. For example, if you want to handle pre_process for message update, then you will have to create pre_process_message function, and so on. Same applies to post_process.
ru: Задайте update_sensitive=True если хотите получать разные апдейты в разных функциях. Например, если вы хотите обрабатывать pre_process для апдейтов вида message, вам нужно будет создать функцию pre_process_message и т.д. Аналогично для post_process.

source: Example of class-based middlewares
ru: Пример класса middleware

source: Class for canceling updates. Just return instance of this class in middleware to skip update. Update will skip handler and execution of post_process in middlewares.
ru: Класс для отмены апдейтов. Просто верните экземпляр этого класса в middleware, чтобы пропустить апдейт. Апдейт пропустит хендлер и исполнение post_process в middleware.

source: Class for continue updates in handlers. Just return instance of this class in handlers to continue process.
ru: Класс для продолжения обработки апдейта в хендлерах. Просто верните экземпляр этого класса в хендлерах, чтобы продолжить обработку.

source: Example of using ContinueHandling
ru: Пример использования ContinueHandling

source: Class for skipping handlers. Just return instance of this class in middleware to skip handler. Update will go to post_process, but will skip execution of handler.
ru: Класс для пропуска хендлеров. Просто верните экземпляр этого класса в middleware, чтобы пропустить хендлер. Апдейт попадёт в post_process, но пропустит исполнение хендлера.

source: Class representing a state.
ru: Класс, представляющий состояние (стейт).

source: Class representing common states.
ru: Класс, представляющий похожие состояния (стейты).

source: Extensions
ru: Расширения

source: This file is used by AsyncTeleBot.run_webhooks() function.
ru: Этот файл используется функцией AsyncTeleBot.run_webhooks().

source: Fastapi and starlette(0.20.2+) libraries are required to run this script.
ru: Для запуска этого скрипта требуются библиотеки Fastapi и starlette(0.20.2+).

source: Run app with the given parameters to init. Not supposed to be used manually by user.
ru: Запустить приложение с заданными параметрами инициализации. Не предназначено для использования пользователем.
