Repository: eternnoir/pyTelegramBotAPI
Catalog: docs/source/locales/*/LC_MESSAGES/async_version.po
Languages: ru

source: Sends the message silently. Users will receive a notification with no sound.
ru: Отправить сообщение, при получении которого пользователи получат уведомление без звука.

source: Protects the contents of the sent message from forwarding and saving
ru: Запретить пересылку и сохранение содержимого сообщения

source: If the message is a reply, ID of the original message
ru: Если сообщение является ответом - id сообщения, на которое дан ответ

source: Pass True, if the message should be sent even if the specified replied-to message is not found
ru: Передайте True, если сообщение нужно отправить даже в случае отсутствия сообщения, на которое дан ответ

source: Additional interface options. A JSON-serialized object for an inline keyboard, custom reply keyboard, instructions to remove reply keyboard or to force a reply from the user.
ru: Дополнительные элементы интерфейса. Inline клавиатура, текстовая клавиатура, запрос на удаление текстовой клавиатуры или запрос на ответ от пользователя.

source: Timeout in seconds for the request.
ru: Таймаут запроса в секундах.

source: Identifier of a message thread, in which the message will be sent
ru: id топика, в который нужно отправить сообщение

source: Sends the message silently. Users will receive a notification with no sound
ru: Отправить сообщение, при получении которого пользователи получат уведомление без звука

source: Identifier of a message thread, in which the messages will be sent
ru: id топика, в который будет отправлена группа медиа

source: Protects the contents of the forwarded message from forwarding and saving
ru: Запретить пересылку и сохранение содержимого пересланного сообщения

source: Use this method to create an additional invite link for a chat. The bot must be an administrator in the chat for this to work and must have the appropriate administrator rights. The link can be revoked using the method revokeChatInviteLink. Returns the new invite link as ChatInviteLink object.
ru: Используйте этот метод, чтобы создать дополнительную ссылку-приглашение в чат. Бот должен быть администратором чата и иметь соответствующие права администратора. Ссылка может быть аннулирована методом revokeChatInviteLink. Возвращает новую ссылку-приглашение (ChatInviteLink).

source: Telegram documentation: https://core.telegram.org/bots/api#createchatinvitelink
ru: Документация Telegram: https://core.telegram.org/bots/api#createchatinvitelink

source: Id: Unique identifier for the target chat or username of the target channel (in the format @channelusername)
ru: Уникальный id чата или username канала (в формате @channelusername)

source: Invite link name; 0-32 characters
ru: Название ссылки-приглашения; 0-32 символа

source: Point in time (Unix timestamp) when the link will expire
ru: Время, когда ссылка будет аннулирована в формате Unix timestamp

source: Maximum number of users that can be members of the chat simultaneously
ru: Максимальное количество пользователей в чате

source: True, if users joining the chat via the link need to be approved by chat administrators. If True, member_limit can't be specified
ru: True, если пользователи, использующие эту ссылку должны быть одобрены администраторами чата. Нельзя использовать True вместе с member_limit

source: Returns the new invite link as ChatInviteLink object.
ru: Возвращает новую ссылку-приглашение (ChatInviteLink).

source: Use this method to create a topic in a forum supergroup chat. The bot must be an administrator in the chat for this to work and must have the can_manage_topics administrator rights. Returns information about the created topic as a ForumTopic object.
ru: Используйте этот метод, чтобы создать топик в супергруппе. Бот должен быть администратором чата и иметь права администратора can_manage_topics. Возвращает информацию о созданном топике (ForumTopic).

source: Telegram documentation: https://core.telegram.org/bots/api#createforumtopic
ru: Документация Telegram: https://core.telegram.org/bots/api#createforumtopic

source: Name of the topic, 1-128 characters
ru: Имя топика, 1-128 символов

source: Color of the topic icon in RGB format. Currently, must be one of 0x6FB9F0, 0xFFD67E, 0xCB86DB, 0x8EEE98, 0xFF93B2, or 0xFB6F5F
ru: Цвет иконки топика в формате RGB. В текущий момент, доступны цвета 0x6FB9F0, 0xFFD67E, 0xCB86DB, 0x8EEE98, 0xFF93B2, or 0xFB6F5F

source: Custom emoji for the topic icon. Must be an emoji of type “tgs” and must be exactly 1 character long
ru: Кастомный эмодзи для использования в качестве иконки топика. Должно быть “tgs” эмодзи и быть ровно 1 символом

source: On success, information about the created topic is returned as a ForumTopic object.
ru: В случае успеха возвращается информация о созданном топике (ForumTopic).

source: Use this method to create a link for an invoice. Returns the created invoice link as String on success.
ru: используйте этот метод, чтобы создать ссылку-инвойс. Возвращает созданную ссылку в случае успеха (String).

source: Telegram documentation: https://core.telegram.org/bots/api#createinvoicelink
ru: Документация Telegram: https://core.telegram.org/bots/api#createinvoicelink

source: Product name, 1-32 characters
ru: Название товара, 1-32 символа

source: Product description, 1-255 characters
ru: Описание товара, 1-255 символов

source: Bot-defined invoice payload, 1-128 bytes. This will not be displayed to the user, use for your internal processes.
ru: Дополнительные данные, 1-128 байт. Не будет показано пользователю, используйте во внутренних процессах.

source: Payments provider token, obtained via @Botfather
ru: Токен платежной системы, полученный через @BotFather

source: Three-letter ISO 4217 currency code, see https://core.telegram.org/bots/payments#supported-currencies
ru: Трехбуквенный код валюты в формате ISO 4217, см. https://core.telegram.org/bots/payments#supported-currencies

source: Price breakdown, a list of components (e.g. product price, tax, discount, delivery cost, delivery tax, bonus, etc.)
ru: Детали цены, список компонент (например цена продукта, налог, скидка, стоимость доставки, налог на доставку, бонус и т.д.)

source: The maximum accepted amount for tips in the smallest units of the currency
ru: Максимальный размер чаевых в наименьших единицах выбранной валюты

source: A JSON-serialized array of suggested amounts of tips in the smallest units of the currency. At most 4 suggested tip amounts can be specified. The suggested tip amounts must be positive, passed in a strictly increased order and must not exceed max_tip_amount.
ru: Массив предлагаемых вариантов чаевых в наименьших единицах выбранной валюты в формате JSON. Можно задать не более 4 вариантов. Варианты чаевых должны быть больше нуля, перечисленные в порядке строгого возрастания и не превышать max_tip_amount.

source: A JSON-serialized data about the invoice, which will be shared with the payment provider. A detailed description of required fields should be provided by the payment provider.
ru: Данные о инвойсе в формате JSON, которые будут переданы платежной системе. Подробное описание обязательных полей должно быть предоставлено провайдером платежной системы.

source: URL of the product photo for the invoice. Can be a photo of the goods or a photo of the invoice. People like it better when they see a photo of what they are paying for.
ru: URL изображения товара для инвойса. Может быть изображением товаров или изображением инвойса. Людям больше нравится видеть фото товара, за который они платят.

source: Photo size in bytes
ru: Вес изображения в байтах

source: Photo width
ru: Ширина изображения

source: Photo height
ru: Высота изображения

source: Pass True, if you require the user's full name to complete the order
ru: Передайте True, если для совершения заказа требуется полное имя пользователя

source: Pass True, if you require the user's phone number to complete the order
ru: Передайте True, если для совершения заказа требуется номер телефона пользователя

source: Pass True, if you require the user's email to complete the order
ru: Передайте True, если для совершения заказа требуется email пользователя

source: Pass True, if you require the user's shipping address to complete the order
ru: Передайте True, если для совершения заказа требуется адрес доставки

source: Pass True, if user's phone number should be sent to provider
ru: Передайте True, если номер телефона пользователя нужно отправить платежной системе

source: Pass True, if user's email address should be sent to provider
ru: Передайте True, если email пользователя нужно отправить платежной системе

source: Pass True, if the final price depends on the shipping method
ru: Передайте True, если окончательная цена зависит от способа доставки

source: Created invoice link as String on success.
ru: Созданная ссылка-инвойс (String) в случае успеха.

source: Use this method to create new sticker set owned by a user. The bot will be able to edit the created sticker set. Returns True on success.
ru: Используйте этот метод, чтобы создать новый стикерпак, владельцем которого станет пользователь. Бот будет иметь возможность редактировать созданный стикерпак. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#createnewstickerset
ru: Документация Telegram: https://core.telegram.org/bots/api#createnewstickerset

source: Short name of sticker set, to be used in t.me/addstickers/ URLs (e.g., animals). Can contain only English letters, digits and underscores. Must begin with a letter, can't contain consecutive underscores and must end in "_by_<bot_username>". <bot_username> is case insensitive. 1-64 characters.
ru: Короткое имя стикерпака для использования в ссылках вида t.me/addstickers/ (например animals). Может содержать только латинские буквы, цифры и нижние подчеркивания. Должно начинаться с буквы, не может содержать подряд идущие нижние подчеркивания и должно заканчиваться на "_by_<bot_username>". <bot_username> учитывает регистр. 1-64 символа.

source: Sticker set title, 1-64 characters
ru: Название стикерпака, 1-64 символа

source: Pass True, if a set of mask stickers should be created. Deprecated since Bot API 6.2, use sticker_type instead.
ru: Передайте True, если создаётся стикерпак масок. Устарело, начиная с Bot API 6.2, используйте sticker_type.

source: Use this method to decline a chat join request. The bot must be an administrator in the chat for this to work and must have the can_invite_users administrator right. Returns True on success.
ru: Используйте этот метод, чтобы отклонить запрос на вступление в чат. Бот должен быть администратором чата и иметь права администратора can_invite_users. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#declinechatjoinrequest
ru: Документация Telegram: https://core.telegram.org/bots/api#declinechatjoinrequest

source: Use this method to delete a chat photo. Photos can't be changed for private chats. The bot must be an administrator in the chat for this to work and must have the appropriate admin rights. Returns True on success. Note: In regular groups (non-supergroups), this method will only work if the ‘All Members Are Admins’ setting is off in the target group.
ru: Используйте этот метод, чтобы удалить фото чата. Нельзя изменить фото в приватных чатах. Бот должен быть администратором чата и иметь соответствующие права администратора. Возвращает True в случае успеха. Примечание: В обычных группах (не супергруппах), метод будет работать только в случаях, когда настройка ‘All Members Are Admins’ выключена.

source: Telegram documentation: https://core.telegram.org/bots/api#deletechatphoto
ru: Документация Telegram: https://core.telegram.org/bots/api#deletechatphoto

source: Int or Str: Unique identifier for the target chat or username of the target channel (in the format @channelusername)
ru: Уникальный id чата или username канала (в формате @channelusername)

source: Use this method to delete a group sticker set from a supergroup. The bot must be an administrator in the chat for this to work and must have the appropriate admin rights. Use the field can_set_sticker_set optionally returned in getChat requests to check if the bot can use this method. Returns True on success.
ru: Используйте этот метод, чтобы удалить стикерпак группы из супергруппы. Бот должен быть администратором чата и иметь соответствующие права администратора. Используйте поле can_set_sticker_set, возвращаемое методом getChat, чтобы проверить, что бот может использовать этот метод. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#deletechatstickerset
ru: Документация Telegram: https://core.telegram.org/bots/api#deletechatstickerset

source: Use this method to delete a topic in a forum supergroup chat. The bot must be an administrator in the chat for this to work and must have the can_manage_topics administrator rights, unless it is the creator of the topic. Returns True on success.
ru: Используйте этот метод, чтобы удалить топик в супергруппе. Бот должен быть администратором чата и иметь права администратора can_manage_topics, за исключением случае, когда бот является создателем топика. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#deleteforumtopic
ru: Документация Telegram: https://core.telegram.org/bots/api#deleteforumtopic

source: Identifier of the topic to delete
ru: id топика, который нужно удалить

source: Use this method to delete a message, including service messages, with the following limitations: - A message can only be deleted if it was sent less than 48 hours ago. - A dice message in a private chat can only be deleted if it was sent more than 24 hours ago. - Bots can delete outgoing messages in private chats, groups, and supergroups. - Bots can delete incoming messages in private chats. - Bots granted can_post_messages permissions can delete outgoing messages in channels. - If the bot is an administrator of a group, it can delete any message there. - If the bot has can_delete_messages permission in a supergroup or a channel, it can delete any message there. Returns True on success.
ru: Используйте этот метод, чтобы удалить сообщение, в том числе сервисное, ограничения: - Сообщение может быть удалено только если оно было отправлено менее 48 часов назад. - Dice-сообщение в приватном чате может быть удалено только если оно было отправлено более 24 часов назад. - Боты могут удалять свои сообщения в приватных чатах, группах и супергруппах. - Боты могут удалять чужие сообщение в приватных чатах. - Боты с правами администратора can_post_messages могут удалять сообщения в каналах. - Если бот является администратором группы, он может удалить любое сообщение в ней. - Если бот имеет права администратора can_delete_messages в супергруппе или канале, он может удалить любое сообщение в них. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#deletemessage
ru: Документация Telegram: https://core.telegram.org/bots/api#deletemessage

source: Identifier of the message to delete
ru: id сообщения, которое нужно удалить

source: Use this method to delete the list of the bot's commands for the given scope and user language. After deletion, higher level commands will be shown to affected users. Returns True on success.
ru: Используйте этот метод, чтобы удалить список команд бота для заданных поля видимости и языка. После удаления, команды более широкого поля видимости будут доступны пользователям, которых коснулись изменения. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#deletemycommands
ru: Документация Telegram: https://core.telegram.org/bots/api#deletemycommands

source: The scope of users for which the commands are relevant. Defaults to BotCommandScopeDefault.
ru: Область видимости команд. По умолчанию BotCommandScopeDefault.

source: A two-letter ISO 639-1 language code. If empty, commands will be applied to all users from the given scope, for whose language there are no dedicated commands
ru: Двухбуквенный языковой код в формате ISO 639-1. Если не задан, изменения коснутся команд для всех пользователей в заданном поле видимости, не имеющих команд на их языке

source: Delete the current state of a user.
ru: Удалить текущее состояние (стейт) пользователя.

source: Use this method to delete a sticker from a set created by the bot. Returns True on success.
ru: Используйте этот метод, чтобы удалить стикер из стикерпака, созданного ботом. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#deletestickerfromset
ru: Документация Telegram: https://core.telegram.org/bots/api#deletestickerfromset

source: File identifier of the sticker
ru: id файла стикера

source: Use this method to remove webhook integration if you decide to switch back to getUpdates. Returns True on success.
ru: Используйте этот метод, чтобы удалить вебхук, если вы решите перейти обратно на getUpdates. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#deletewebhook
ru: Документация Telegram: https://core.telegram.org/bots/api#deletewebhook

source: Pass True to drop all pending updates, defaults to None
ru: Передайте True, чтобы удалить все предшествующие запуску бота апдейты, по умолчанию None

source: Request connection timeout, defaults to None
ru: Тайм-аут запроса, по умолчанию None

source: Downloads file.
ru: Скачивает файл.

source: Path where the file should be downloaded.
ru: Путь, куда файл нужно сохранить.

source: Use this method to edit a non-primary invite link created by the bot. The bot must be an administrator in the chat for this to work and must have the appropriate admin rights.
ru: Используйте этот метод, чтобы изменить неосновную ссылку-приглашение, созданную ботом. Бот должен быть администратором чата и иметь соответствующие права администратора.

source: Telegram documentation: https://core.telegram.org/bots/api#editchatinvitelink
ru: Документация Telegram: https://core.telegram.org/bots/api#editchatinvitelink

source: The invite link to edit
ru: Ссылка-приглашение для изменения

source: Use this method to edit name and icon of a topic in a forum supergroup chat. The bot must be an administrator in the chat for this to work and must have can_manage_topics administrator rights, unless it is the creator of the topic. Returns True on success.
ru: Используйте этот метод, чтобы изменить название и иконку топика в супергруппе. Бот должен быть администратором чата и иметь права администратора can_manage_topics, кроме случаев, когда бот является создателем топика. Возвращает True в случае успеха.

source: Telegram Documentation: https://core.telegram.org/bots/api#editforumtopic
ru: Документация Telegram: https://core.telegram.org/bots/api#editforumtopic

source: Identifier of the topic to edit
ru: id топика для изменения

source: Optional, New name of the topic, 1-128 characters. If not specififed or empty, the current name of the topic will be kept
ru: Необязательный, новое имя топика, 1-128 символов. Если не задано или пустое, сохранится текущее имя топика

source: Optional, New unique identifier of the custom emoji shown as the topic icon. Use getForumTopicIconStickers to get all allowed custom emoji identifiers. Pass an empty string to remove the icon. If not specified, the current icon will be kept
ru: Необязательный, новый уникальный id кастомного эмодзи, используемого в качестве иконки топика. Используйте getForumTopicIconStickers, чтобы получить все доступные id кастомных эмодзи. Передайте пустую строку, чтобы убрать иконку. Если не задан, сохранится текущая иконка топика

source: Use this method to edit the name of the 'General' topic in a forum supergroup chat. The bot must be an administrator in the chat for this to work and must have can_manage_topics administrator rights. Returns True on success.
ru: Используйте этот метод, чтобы удалить топик в супергруппе. Бот должен быть администратором чата и иметь права администратора can_manage_topics, за исключением случае, когда бот является создателем топика. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#editgeneralforumtopic
ru: Документация Telegram: https://core.telegram.org/bots/api#editforumtopic

source: New topic name, 1-128 characters
ru: Название товара, 1-32 символа

source: Use this method to edit captions of messages.
ru: Используйте этот метод, чтобы изменить подписи к медиа в сообщениях

source: Telegram documentation: https://core.telegram.org/bots/api#editmessagecaption
ru: Документация Telegram: https://core.telegram.org/bots/api#editmessagecaption

source: New caption of the message
ru: Новая подпись к медиа

source: Required if inline_message_id is not specified. Unique identifier for the target chat or username of the target channel
ru: Обязательный, если не указан inline_message_id. Уникальный id чата или username канала

source: Required if inline_message_id is not specified.
ru: Обязательный, если не указан inline_message_id.

source: Required if inline_message_id is not specified. Identifier of the inline message.
ru: Обязательный, если не указан inline_message_id. id inline сообщения.

source: New caption of the message, 0-1024 characters after entities parsing
ru: Новая подпись к медиа в сообщении, 0-1024 символа после форматирования

source: A JSON-serialized array of objects that describe how the caption should be parsed.
ru: Массив объектов, описывающих то, как будет происходить парсинг подписи к медиа в формате JSON.

source: A JSON-serialized object for an inline keyboard.
ru: JSON-сериализованный объект inline клавиатуры.

source: On success, if edited message is sent by the bot, the edited Message is returned, otherwise True is returned.
ru: В случае успеха, если изменённое сообщение отправлено ботом, возвращается новый объект Message, иначе (inline сообщения) возвращается True.

source: Use this method to edit live location messages. A location can be edited until its live_period expires or editing is explicitly
ru: Используйте этот метод, чтобы изменить live местоположение в сообщении. Местоположение может быть изменено пока не истечёт live_period или не

source: disabled by a call to stopMessageLiveLocation. On success, if the edited message is not an inline message, the edited Message is returned, otherwise True is returned.
ru: отключено вызовом метода stopMessageLiveLocation. В случае успеха, если измененное сообщение не является inline сообщением, возвращается новый объект Message, иначе возвращается True.

source: Telegram documentation: https://core.telegram.org/bots/api#editmessagelivelocation
ru: Документация Telegram: https://core.telegram.org/bots/api#editmessagelivelocation

source: Latitude of new location
ru: Широта нового местоположения

source: Longitude of new location
ru: Долгота нового местоположения

source: Required if inline_message_id is not specified. Identifier of the message to edit
ru: Обязательный, если не указан inline_message_id. id сообщения, которое нужно изменить

source: A JSON-serialized object for a new inline keyboard.
ru: JSON-сериализованный объект новой inline клавиатуры.

source: Required if chat_id and message_id are not specified. Identifier of the inline message
ru: Обязательный, если не указаны chat_id и message_id. id inline сообщения

source: The radius of uncertainty for the location, measured in meters; 0-1500
ru: Радиус погрешности местоположения, измеряется в метрах; 0-1500

source: Direction in which the user is moving, in degrees. Must be between 1 and 360 if specified.
ru: Направление, в котором пользователь двигается, в градусах. Если указано, должно быть от 1 до 360.
