Repository: eternnoir/pyTelegramBotAPI
Catalog: docs/source/locales/*/LC_MESSAGES/async_version.po
Languages: ru

source: Track name
ru: Название трека

source: Mode for parsing entities in the audio caption. See formatting options for more details.
ru: Режим форматирования подписи к аудио. См. formatting options для получения подробностей.

source: Thumbnail of the file sent; can be ignored if thumbnail generation for the file is supported server-side. The thumbnail should be in JPEG format and less than 200 kB in size. A thumbnail's width and height should not exceed 320. Ignored if the file is not uploaded using multipart/form-data. Thumbnails can't be reused and can be only uploaded as a new file, so you can pass “attach://<file_attach_name>” if the thumbnail was uploaded using multipart/form-data under <file_attach_name>
ru: Обложка отправленного файла; может быть проигнорирована, если генерация обложки поддерживается на стороне сервера. Обложка должна быть картинкой в формате JPEG и весить менее 200 kB. Ширина и высота обложки не должны превышать 320. Игнорируется, если файл не загружен с помощью multipart/form-data. Обложки не могут быть использованы повторно и могут быть загружены только как новый файл, так что вы можете передать “attach://<file_attach_name>” если обложка была загружена с помощью multipart/form-data под именем <file_attach_name>.

source: A JSON-serialized list of special entities that appear in the caption, which can be specified instead of parse_mode
ru: Список отформатированных частей подписи в формате JSON, можно использовать вместо parse_mode

source: Use this method when you need to tell the user that something is happening on the bot's side. The status is set for 5 seconds or less (when a message arrives from your bot, Telegram clients clear its typing status). Returns True on success.
ru: Используйте этот метод, когда вам нужно показать пользователю, что бот что-то делает. Статус устанавливается на 5 секунд или менее (когда от бота приходит сообщение, клиенты (приложения) Telegram убирают статус typing). Возвращает True в случае успеха.

source: Example: The ImageBot needs some time to process a request and upload the image. Instead of sending a text message along the lines of “Retrieving image, please wait…”, the bot may use sendChatAction with action = upload_photo. The user will see a “sending photo” status for the bot.
ru: Пример: ImageBot-у требуется время, чтобы обработать запрос и загрузить изображение. Вместо отправки текстового сообщения “Отправка изображения, пожалуйста подождите…”, бот может использовать sendChatAction с параметром action = upload_photo. Пользователь увидит статус бота “sending photo”.

source: Telegram documentation: https://core.telegram.org/bots/api#sendchataction
ru: Документация Telegram: https://core.telegram.org/bots/api#sendchataction

source: Type of action to broadcast. Choose one, depending on what the user is about to receive: typing for text messages, upload_photo for photos, record_video or upload_video for videos, record_voice or upload_voice for voice notes, upload_document for general files, choose_sticker for stickers, find_location for location data, record_video_note or upload_video_note for video notes.
ru: Тип действия. Выберите один, в зависимости от того, что получит пользователь: typing для текстовых сообщений, upload_photo для фото, record_video или upload_video для видео, record_voice или upload_voice для голосовых сообщений, upload_document для файлов, choose_sticker для стикеров, find_location для данных о местоположении, record_video_note или upload_video_note для видео заметок (кружочков).

source: The thread to which the message will be sent(supergroups only)
ru: id топика, в который сообщение будет отправлено(только для супергрупп)

source: Use this method to send phone contacts. On success, the sent Message is returned.
ru: Используйте этот метод, чтобы отправить контакт. В случае успеха, возвращается отправленное сообщение (Message).

source: Telegram documentation: https://core.telegram.org/bots/api#sendcontact
ru: Документация Telegram: https://core.telegram.org/bots/api#sendcontact

source: Contact's phone number
ru: Телефонный номер контакта

source: Contact's first name
ru: Имя контакта

source: Contact's last name
ru: Фамилия контакта

source: Additional data about the contact in the form of a vCard, 0-2048 bytes
ru: Дополнительные данные о контакте в формате vCard, 0-2048 байт

source: Pass True, if the message should be sent even if one of the specified replied-to messages is not found.
ru: Передайте True, если сообщение должно быть отправлено даже если одно из сообщений, на которые нужно ответить, не найдено.

source: The thread to which the message will be sent
ru: Топик, в который сообщение будет отправлено

source: Use this method to send an animated emoji that will display a random value. On success, the sent Message is returned.
ru: Используйте этот метод, чтобы отправить анимированный эмодзи, который покажет случайное значение. В случае успеха, возвращается отправленное сообщение (Message).

source: Telegram documentation: https://core.telegram.org/bots/api#senddice
ru: Документация Telegram: https://core.telegram.org/bots/api#senddice

source: Emoji on which the dice throw animation is based. Currently, must be one of “🎲”, “🎯”, “🏀”, “⚽”, “🎳”, or “🎰”. Dice can have values 1-6 for “🎲”, “🎯” and “🎳”, values 1-5 for “🏀” and “⚽”, and values 1-64 for “🎰”. Defaults to “🎲”
ru: Эмодзи, на котором основана анимация. На текущий момент, должно быть одним из “🎲”, “🎯”, “🏀”, “⚽”, “🎳”, или “🎰”. Значение может быть 1-6 для “🎲”, “🎯” и “🎳”, 1-5 для “🏀” и “⚽”, и 1-64 для “🎰”. По умолчанию “🎲”

source: Protects the contents of the sent message from forwarding
ru: Защищает содержимое отправленного сообщения от пересылки

source: The identifier of a message thread, unique within the chat to which the message with the thread identifier belongs
ru: id топика, в который сообщение будет отправлено

source: Use this method to send general files.
ru: Используйте этот метод, чтобы отправить файл.

source: Telegram documentation: https://core.telegram.org/bots/api#senddocument
ru: Документация Telegram: https://core.telegram.org/bots/api#senddocument

source: (document) File to send. Pass a file_id as String to send a file that exists on the Telegram servers (recommended), pass an HTTP URL as a String for Telegram to get a file from the Internet, or upload a new one using multipart/form-data
ru: (документ) Файл для отправки. Передайте file_id (String), чтобы отправить файл, который уже загружен на сервера Telegram (рекомендуется), передайте HTTP URL (String), чтобы отправить файл из интернета или загрузите новый с помощью multipart/form-data

source: Document caption (may also be used when resending documents by file_id), 0-1024 characters after entities parsing
ru: Подпись к файлу (может быть использована при повторной отправке файла по file_id), 0-1024 символа после форматирования

source: Mode for parsing entities in the document caption
ru: Режим форматирования частей подписи к файлу

source: InputFile or String : Thumbnail of the file sent; can be ignored if thumbnail generation for the file is supported server-side. The thumbnail should be in JPEG format and less than 200 kB in size. A thumbnail's width and height should not exceed 320. Ignored if the file is not uploaded using multipart/form-data. Thumbnails can't be reused and can be only uploaded as a new file, so you can pass “attach://<file_attach_name>” if the thumbnail was uploaded using multipart/form-data under <file_attach_name>
ru: InputFile или String : Обложка отправленного файла; может быть проигнорирована, если генерация обложки поддерживается на стороне сервера. Обложка должна быть картинкой в формате JPEG и весить менее 200 kB. Ширина и высота обложки не должны превышать 320. Игнорируется, если файл не загружен с помощью multipart/form-data. Обложки не могут быть использованы повторно и могут быть загружены только как новый файл, так что вы можете передать “attach://<file_attach_name>” если обложка была загружена с помощью multipart/form-data под именем <file_attach_name>.

source: allows to define file name that will be visible in the Telegram instead of original file name
ru: позволяет задать имя файла, которое будет показано в Telegram вместо настоящего

source: Disables automatic server-side content type detection for files uploaded using multipart/form-data
ru: Отключает автоматическое обнаружение типа файла на стороне сервера для файлов, загруженных с помощью multipart/form-data

source: function typo miss compatibility: do not use it
ru: опечатка: не используйте

source: Used to send the game.
ru: Используется для отправки игры.

source: Telegram documentation: https://core.telegram.org/bots/api#sendgame
ru: Документация Telegram: https://core.telegram.org/bots/api#sendgame

source: Short name of the game, serves as the unique identifier for the game. Set up your games via @BotFather.
ru: Короткое имя игры, служит в качестве уникального id игры. Настройте свои игрычерез @BotFather.

source: Timeout in seconds for waiting for a response from the bot.
ru: Тайм-аут в секундах, ожидание ответа от бота.

source: Pass True, if content of the message needs to be protected from being viewed by the bot.
ru: Передайте True, если содержимое сообщение должно быть защищено от просмотра ботом.

source: Identifier of the thread to which the message will be sent.
ru: id топика, в которые будет сообщение будет отправлено.

source: Sends invoice.
ru: Отправляет инвойс.

source: Telegram documentation: https://core.telegram.org/bots/api#sendinvoice
ru: Документация Telegram: https://core.telegram.org/bots/api#sendinvoice

source: Unique identifier for the target private chat
ru: Уникальный id приватного чата

source: Unique deep-linking parameter that can be used to generate this invoice when used as a start parameter
ru: Уникальный deep-linking параметр, который может быть использован для генерации этого инвойса при использовании в качестве параметра /start

source: URL of the product photo for the invoice. Can be a photo of the goods or a marketing image for a service. People like it better when they see what they are paying for.
ru: URL фото продукта. Может быть фото товаров или рекламным изображением сервиса. Людям больше нравится, когда они видят, за что платят.

source: A JSON-serialized object for an inline keyboard. If empty, one 'Pay total price' button will be shown. If not empty, the first button must be a Pay button
ru: JSON-сериализованный объект inline клавиатуры. Если пустой, будет показана одна кнопка 'Pay total price'. Если не пустой, первая кнопка должна быть кнопкой для оплаты

source: Timeout of a request, defaults to None
ru: Тайм-аут запроса, по умолчанию None

source: The identifier of a message thread, in which the invoice message will be sent
ru: id топика, в который будет отправлен инвойс

source: Use this method to send point on the map. On success, the sent Message is returned.
ru: Используйте этот метод, чтобы отправить точку на карте. В случае успеха, возвращается отправленное сообщение (Message).

source: Telegram documentation: https://core.telegram.org/bots/api#sendlocation
ru: Документация Telegram: https://core.telegram.org/bots/api#sendlocation

source: Latitude of the location
ru: Широта

source: Longitude of the location
ru: Долгота

source: Period in seconds for which the location will be updated (see Live Locations, should be between 60 and 86400.
ru: Время в секундах, в течение которого местоположение будет обновляться (см. Live Locations), должно быть между 60 и 86400.

source: For live locations, a direction in which the user is moving, in degrees. Must be between 1 and 360 if specified.
ru: Для live местоположений, направление, в котором пользователь двигается, в градусах. Должно быть между 1 и 360, если указано.

source: For live locations, a maximum distance for proximity alerts about approaching another chat member, in meters. Must be between 1 and 100000 if specified.
ru: Для live местоположений, максимальное расстояние для уведомлений о приближении другого участника чата, в метрах. Должно быть между 1 и 100000, если указано.

source: Use this method to send a group of photos, videos, documents or audios as an album. Documents and audio files can be only grouped in an album with messages of the same type. On success, an array of Messages that were sent is returned.
ru: Используйте этот метод, чтобы отправить группу фото, видео, файлов или аудио как альбом. Файлы и аудио могут быть сгруппированы в альбом только с сообщениями того же типа. В случае успеха, возвращается массив отправленных сообщений (Message).

source: Telegram documentation: https://core.telegram.org/bots/api#sendmediagroup
ru: Документация Telegram: https://core.telegram.org/bots/api#sendmediagroup

source: A JSON-serialized array describing messages to be sent, must include 2-10 items
ru: JSON-сериализованный массив, описывающий сообщения для отправки, должен включать от 2 до 10 элементов

source: Sends the messages silently. Users will receive a notification with no sound.
ru: Отправить сообщение, при получении которого пользователя пользователи получат уведомление без звука.

source: On success, an array of Messages that were sent is returned.
ru: В случае успеха, возвращается массив отправленных сообщений (Message).

source: Use this method to send text messages.
ru: Используйте этот метод, чтобы отправлять текстовые сообщения.

source: Warning: Do not send more than about 4096 characters each message, otherwise you'll risk an HTTP 414 error. If you must send more than 4096 characters, use the `split_string` or `smart_split` function in util.py.
ru: Предупреждение: Не отправляйте больше 4096 символов в одном сообщении, иначе вы рискуете получить ошибку HTTP 414. Если вам нужно отправить больше 4096 символов, используйте функцию `split_string` или `smart_split` из util.py.

source: Telegram documentation: https://core.telegram.org/bots/api#sendmessage
ru: Документация Telegram: https://core.telegram.org/bots/api#sendmessage

source: Text of the message to be sent
ru: Текст сообщения для отправки

source: List of special entities that appear in message text, which can be specified instead of parse_mode
ru: Список отформатированных частей в тексте сообщения, можно использовать вместо parse_mode

source: If True, the message content will be hidden for all users except for the target user
ru: Если True, содержимое сообщения будет скрыто от всех пользователей, кроме заданного

source: Use this method to send photos. On success, the sent Message is returned.
ru: Используйте этот метод, чтобы отправить фото. В случае успеха, возвращается отправленное сообщение (Message).

source: Telegram documentation: https://core.telegram.org/bots/api#sendphoto
ru: Документация Telegram: https://core.telegram.org/bots/api#sendphoto

source: Photo to send. Pass a file_id as String to send a photo that exists on the Telegram servers (recommended), pass an HTTP URL as a String for Telegram to get a photo from the Internet, or upload a new photo using multipart/form-data. The photo must be at most 10 MB in size. The photo's width and height must not exceed 10000 in total. Width and height ratio must be at most 20.
ru: Фото для отправки. Передайте file_id (String), чтобы отправить фото, которое уже загружено на сервера Telegram (рекомендуется), передайте HTTP URL (String), чтобы отправить фото из интернета или загрузите новое с помощью multipart/form-data. Фото должно весить не более 10 MB. Ширина и высота фото не должны суммарно превышать 10000. Отношение ширины и высоты должно быть не более 20.

source: Photo caption (may also be used when resending photos by file_id), 0-1024 characters after entities parsing
ru: Подпись к фото (может быть использована при повторной отправке файла по file_id), 0-1024 символа после форматирования

source: Mode for parsing entities in the photo caption.
ru: Режим форматирования подписи к фото.

source: Pass True, if the photo should be sent as a spoiler
ru: Передайте True, если фото должно быть отправлено как спойлер

source: Use this method to send a native poll. On success, the sent Message is returned.
ru: Используйте этот метод, чтобы отправить опрос. В случае успеха, возвращается отправленное сообщение (Message).

source: Telegram documentation: https://core.telegram.org/bots/api#sendpoll
ru: Документация Telegram: https://core.telegram.org/bots/api#sendpoll

source: Poll question, 1-300 characters
ru: Тема опроса, 1-300 символов

source: A JSON-serialized list of answer options, 2-10 strings 1-100 characters each
ru: JSON-сериализованный список вариантов ответа, 2-10 строк по 1-100 символов

source: True, if the poll needs to be anonymous, defaults to True
ru: True, если опрос должен быть анонимным, по умолчанию True

source: Poll type, “quiz” or “regular”, defaults to “regular”
ru: Вид опроса, “quiz” или “regular”, по умолчанию “regular”

source: True, if the poll allows multiple answers, ignored for polls in quiz mode, defaults to False
ru: True, если опрос позволяет выбрать несколько вариантов ответа, игнорируется в опросах вида “quiz”, по умолчанию False

source: 0-based identifier of the correct answer option. Available only for polls in quiz mode, defaults to None
ru: Индекс правильного варианта ответа, начиная с 0. Доступно только для опросов вида “quiz”, по умолчанию None

source: Text that is shown when a user chooses an incorrect answer or taps on the lamp icon in a quiz-style poll, 0-200 characters with at most 2 line feeds after entities parsing
ru: Текст, который будет показан при выборе неправильно варианта ответа или нажатии на иконку лампочки в опросах вида “quiz”, 0-200 символов и не более 2 строк после форматирования

source: Mode for parsing entities in the explanation. See formatting options for more details.
ru: Режим форматирования explanation. См. formatting options для получения подробностей.

source: Amount of time in seconds the poll will be active after creation, 5-600. Can't be used together with close_date.
ru: Время в секундах, в течение которого опрос будет активен, 5-600. Нельзя использовать вместо с close_date.

source: Point in time (Unix timestamp) when the poll will be automatically closed.
ru: Время (UNIX timestamp), когда опрос будет автоматически завершен.

source: Pass True, if the poll needs to be immediately closed. This can be useful for poll preview.
ru: Передайте True, если опрос должен быть завершен немедленно. Может быть полезно для предпросмотра опроса.

source: Pass True, if the poll allows multiple options to be voted simultaneously.
ru: Передайте True, если опрос позволяет выбрать несколько вариантов одновременно.

source: Timeout in seconds for waiting for a response from the user.
ru: Тайм-аут в секундах, ожидание ответа от пользователя.

source: A JSON-serialized list of special entities that appear in the explanation, which can be specified instead of parse_mode
ru: JSON-сериализованный список отформатированных частей explanation, можно использовать вместо parse_mode

source: The identifier of a message thread, in which the poll will be sent
ru: id топика, в который будет отправлен опрос

source: Use this method to send static .WEBP, animated .TGS, or video .WEBM stickers. On success, the sent Message is returned.
ru: Используйте этот метод, чтобы отправить статичный .WEBP, анимированный .TGS, или видео .WEBM стикер. В случае успеха возвращает отправленное сообщение (Message).

source: Telegram documentation: https://core.telegram.org/bots/api#sendsticker
ru: Документация Telegram: https://core.telegram.org/bots/api#sendsticker

source: Sticker to send. Pass a file_id as String to send a file that exists on the Telegram servers (recommended), pass an HTTP URL as a String for Telegram to get a .webp file from the Internet, or upload a new one using multipart/form-data.
ru: Стикер для отправки. Передайте file_id (String), чтобы отправить файл, который уже загружен на сервера Telegram (рекомендуется), передайте HTTP URL (String), чтобы отправить .webp файл из интернета или загрузите новый с помощью multipart/form-data.

source: to disable the notification
ru: отключить уведомление

source: Use this method to send information about a venue. On success, the sent Message is returned.
ru: Используйте этот метод, чтобы отправить информацию о месте. В случае успеха возвращается отправленное сообщение (Message).

source: Telegram documentation: https://core.telegram.org/bots/api#sendvenue
ru: Документация Telegram: https://core.telegram.org/bots/api#sendvenue

source: Latitude of the venue
ru: Широта

source: Longitude of the venue
ru: Долгота

source: Name of the venue
ru: Название места

source: Address of the venue
ru: Адрес места

source: Foursquare identifier of the venue
ru: id места на Foursquare

source: Foursquare type of the venue, if known. (For example, “arts_entertainment/default”, “arts_entertainment/aquarium” or “food/icecream”.)
ru: Тип места на Foursquare, если известен. (Например, “arts_entertainment/default”, “arts_entertainment/aquarium” или “food/icecream”.)

source: Google Places identifier of the venue
ru: id места на Google Places

source: Google Places type of the venue.
ru: Тип места на Google Places.

source: Use this method to send video files, Telegram clients support mp4 videos (other formats may be sent as Document).
ru: Используйте этот метод, чтобы отправить видео, клиенты (приложения) Telegram поддерживают mp4 видео (другие форматы могут быть отправлены как Document).

source: Telegram documentation: https://core.telegram.org/bots/api#sendvideo
ru: Документация Telegram: https://core.telegram.org/bots/api#sendvideo

source: Video to send. You can either pass a file_id as String to resend a video that is already on the Telegram servers, or upload a new video file using multipart/form-data.
ru: Видео для отправки. Передайте file_id (String), чтобы отправить видео, которое уже загружено на сервера Telegram или загрузите новое с помощью multipart/form-data.

source: Duration of sent video in seconds
ru: Длительность отправленного видео в секундах

source: Video width
ru: Ширина видео

source: Video height
ru: Высота видео

source: Video caption (may also be used when resending videos by file_id), 0-1024 characters after entities parsing
ru: Подпись к видео (может быть использована при повторной отправке файла по file_id), 0-1024 символа после форматирования

source: Mode for parsing entities in the video caption
ru: Режим форматирования подписи к видео

source: Pass True, if the uploaded video is suitable for streaming
ru: Передайте True, если загруженное видео подходит для стриминга

source: Pass True, if the video should be sent as a spoiler
ru: Передайте True, если видео должно быть отправлено как спойлер

source: As of v.4.0, Telegram clients support rounded square MPEG4 videos of up to 1 minute long. Use this method to send video messages. On success, the sent Message is returned.
ru: Начиная с версии v.4.0, клиенты(приложения) Telegram поддерживают скругленные квадратные MPEG4 видео длительностью до минуты. Используйте этот метод, чтобы отправить видео заметку (кружочек). В случае успеха возвращается отправленное сообщение (Message).

source: Telegram documentation: https://core.telegram.org/bots/api#sendvideonote
ru: Документация Telegram: https://core.telegram.org/bots/api#sendvideonote

source: Video note to send. Pass a file_id as String to send a video note that exists on the Telegram servers (recommended) or upload a new video using multipart/form-data. Sending video notes by a URL is currently unsupported
ru: Видео заметка для отправки. Передайте file_id (String), чтобы отправить видео заметку, которая уже загружена на сервера Telegram или загрузите новую с помощью multipart/form-data. На текущий момент, отправка видео заметок по URL не поддерживается
