Repository: eternnoir/pyTelegramBotAPI
Catalog: docs/source/locales/*/LC_MESSAGES/async_version.po
Languages: ru

source: Asynchronous pyTelegramBotAPI
ru: Асинхронный pyTelegramBotAPI

source: ptba, pytba, pyTelegramBotAPI, asynctelebot, documentation
ru: ptba, pytba, pyTelegramBotAPI, asynctelebot, документация

source: AsyncTeleBot methods
ru: Методы класса AsyncTeleBot

source: Bases: :py:class:`object`
ru: Базовые классы: :py:class:`object`

source: This is the main asynchronous class for Bot.
ru: Это основной класс для асинхронного бота.

source: It allows you to add handlers for different kind of updates.
ru: Позволяет добавить хендлеры для различных апдейтов.

source: Usage:
ru: Использование:

source: Using asynchronous implementation of TeleBot.
ru: Использование асинхронной реализации TeleBot-а.

source: See more examples in examples/ directory: https://github.com/eternnoir/pyTelegramBotAPI/tree/master/examples
ru: Больше примеров в папке examples/ : https://github.com/eternnoir/pyTelegramBotAPI/tree/master/examples

source: Install coloredlogs module to specify colorful_logs=True
ru: Установите пакет coloredlogs для использования colorful_los=True

source: Token of a bot, obtained from @BotFather
ru: Токен бота, нужно получить от @BotFather

source: Default parse mode, defaults to None
ru: Глобальный parse_mode, по умолчанию None

source: Offset used in get_updates, defaults to None
ru: Смещение, используемое в get_updates, по умолчанию None

source: Exception handler, which will handle the exception occured, defaults to None
ru: Класс для обработки исключений, по умолчанию None

source: Storage for states, defaults to StateMemoryStorage()
ru: Хранилище состояний (стейтов), по умолчанию StateMemoryStorage()

source: Default value for disable_web_page_preview, defaults to None
ru: Глобальное значение disable_web_page_preview, по умолчанию None

source: Default value for disable_notification, defaults to None
ru: Глобальное значение disable_notification, по умолчанию None

source: Default value for protect_content, defaults to None
ru: Глобальное значение protect_content, по умолчанию None

source: Default value for allow_sending_without_reply, defaults to None
ru: Глобальное значение allow_sending_without_reply, по умолчанию None

source: Outputs colorful logs
ru: Использовать разноцветные логи

source: Create custom filter.
ru: Создать кастомный фильтр.

source: Example on checking the text of a message
ru: Пример проверки текста сообщения

source: Class with check(message) method.
ru: Класс с методом check(message)

source: Add data to states.
ru: Добавить данные в состояние (стейт).

source: User's identifier
ru: id пользователя

source: Chat's identifier
ru: id чата

source: Data to add
ru: Данные для добавления

source: Telegram documentation: https://core.telegram.org/bots/api#addstickertoset
ru: Документация Telegram: https://core.telegram.org/bots/api#addstickertoset

source: User identifier of created sticker set owner
ru: id пользователя, создавшего стикерпак

source: Sticker set name
ru: Имя стикерпака

source: One or more emoji corresponding to the sticker
ru: Один или несколько эмодзи, относящихся к стикеру

source: PNG image with the sticker, must be up to 512 kilobytes in size, dimensions must not exceed 512px, and either width or height must be exactly 512px. Pass a file_id as a String to send a file that already exists on the Telegram servers, pass an HTTP URL as a String for Telegram to get a file from the Internet, or upload a new one using multipart/form-data.
ru: Изображение стикера в формате PNG, весом не более 512 килобайт, размеры не должны превышать 512px, либо ширина, либо высота должны быть ровно 512px. Передайте file_id в формате str, чтобы отправить уже загруженный на сервера Telegram файл, передайте HTTP URL в формате str, чтобы Telegram скачал файл из интернета, или загрузите новый файл с помощью multipart/form-data.

source: TGS animation with the sticker, uploaded using multipart/form-data.
ru: Анимированный стикер в формате TGS, загруженный с помощью multipart/form-data.

source: WebM animation with the sticker, uploaded using multipart/form-data.
ru: Анимированный стикер в формате WebM, загруженный с помощью multipart/form-data.

source: A JSON-serialized object for position where the mask should be placed on faces
ru: Позиция для размещения маски на лицах в формате JSON

source: On success, True is returned.
ru: В случае успеха возвращается True.

source: Use this method to send answers to callback queries sent from inline keyboards. The answer will be displayed to the user as a notification at the top of the chat screen or as an alert.
ru: Используйте этот метод для отправки ответов на callback запросы, отправленные с помощью inline кнопок. Ответ будет показан пользователю как уведомление поверх чата или pop-up предупреждение.

source: Telegram documentation: https://core.telegram.org/bots/api#answercallbackquery
ru: Документация Telegram: https://core.telegram.org/bots/api#answercallbackquery

source: Unique identifier for the query to be answered
ru: Уникальный id запроса для ответа

source: Text of the notification. If not specified, nothing will be shown to the user, 0-200 characters
ru: Текст уведомления. если не задан, то уведомление не будет показано, 0-200 символов

source: If True, an alert will be shown by the client instead of a notification at the top of the chat screen. Defaults to false.
ru: Если True, вместо уведомления поверх чата будет показано pop-up предупреждение, по умолчанию False.

source: URL that will be opened by the user's client. If you have created a Game and accepted the conditions via @BotFather, specify the URL that opens your game - note that this will only work if the query comes from a callback_game button.
ru: URL, который будет открыт пользовательским клиентом. Если вы создали игру и приняли условия через @BotFather, задайте URL, открывающий вашу игру - учитывайте, что это сработает только если запрос был отправлен с помощью callback_game кнопки.

source: The maximum amount of time in seconds that the result of the callback query may be cached client-side. Telegram apps will support caching starting in version 3.14. Defaults to 0.
ru: Максимальная длительность хранения ответа на callback запрос пользовательским клиентом в секундах. Приложения Telegram поддерживают хранение ответов начиная с версии 3.14, по умолчанию 0.

source: Use this method to send answers to an inline query. On success, True is returned. No more than 50 results per query are allowed.
ru: Используйте этот метод для отправки ответов на inline запрос. В случае успеха возвращается True. Разрешено отправить не более 50 результатов на один запрос.

source: Telegram documentation: https://core.telegram.org/bots/api#answerinlinequery
ru: Документация Telegram: https://core.telegram.org/bots/api#answerinlinequery

source: Unique identifier for the answered query
ru: Уникальный id запроса для ответа

source: Array of results for the inline query
ru: Массив результатов для ответа на inline запрос

source: The maximum amount of time in seconds that the result of the inline query may be cached on the server.
ru: Максимальная длительность хранения результатов inline запроса на сервере в секундах.

source: Pass True, if results may be cached on the server side only for the user that sent the query.
ru: Передайте True, если результаты должны быть сохранены на сервере только для пользователя, отправившего запрос.

source: Pass the offset that a client should send in the next query with the same text to receive more results.
ru: Передайте смещение, которое клиент должен отправить в следующем запросе с таким же текстом, чтобы получить новые результаты.

source: Deep-linking parameter for the /start message sent to the bot when user presses the switch button. 1-64 characters, only A-Z, a-z, 0-9, _ and - are allowed. Example: An inline bot that sends YouTube videos can ask the user to connect the bot to their YouTube account to adapt search results accordingly. To do this, it displays a 'Connect your YouTube account' button above the results, or even before showing any. The user presses the button, switches to a private chat with the bot and, in doing so, passes a start parameter that instructs the bot to return an OAuth link. Once done, the bot can offer a switch_inline button so that the user can easily return to the chat where they wanted to use the bot's inline capabilities.
ru: Параметр для команды /start, отправляемой боту, когда пользователь нажимает кнопку переключения. 1-64 символа, разрешены только A-Z, a-z, 0-9, _ и -. Пример: Inline бот, который отправляет видео с YouTube может попросить пользователя подключить бота к его YouTube аккаунту, чтобы поиск соответствовал предпочтениям пользователя. Чтобы это сделать, бот отправляет пользователю кнопку 'Подключить YouTube аккаунт' над результатами, или даже до их показа. Пользователь нажимает на кнопку, автоматически переходит в приватный чат с ботом и в это время передаёт стартовый параметр, по которому бот возвращает ссылку для авторизации (OAuth). Как только авторизация пройдена, бот может предложить switch_inline кнопку, чтобы пользователь мог легко вернуться в чат, где он хотел использовать возможности inline бота.

source: Parameter for the start message sent to the bot when user presses the switch button
ru: Параметр для передачи боту вместе с сообщением /start, отправленному при нажатии кнопки переключения

source: Once the user has confirmed their payment and shipping details, the Bot API sends the final confirmation in the form of an Update with the field pre_checkout_query. Use this method to respond to such pre-checkout queries. On success, True is returned.
ru: Как только пользователь подтвердил детали оплаты и доставки, Bot API отправляет финальное подтверждение в виде апдейта с полем pre_checkout_query. Используйте этот метод для ответа на такие pre-checkout запросы. В случае успеха возвращается True.

source: The Bot API must receive an answer within 10 seconds after the pre-checkout query was sent.
ru: Bot API должно получить ответ в течение 10 секунд после отправки pre-checkout запроса.

source: Telegram documentation: https://core.telegram.org/bots/api#answerprecheckoutquery
ru: Документация Telegram: https://core.telegram.org/bots/api#answerprecheckoutquery

source: Specify True if everything is alright (goods are available, etc.) and the bot is ready to proceed with the order. Use False if there are any problems.
ru: Задайте True если всё правильно (выбранные товары доступны и т.д.) и бот готов обработать заказ. Задайте False если есть какие-то проблемы.

source: Required if ok is False. Error message in human readable form that explains the reason for failure to proceed with the checkout (e.g. "Sorry, somebody just bought the last of our amazing black T-shirts while you were busy filling out your payment details. Please choose a different color or garment!"). Telegram will display this message to the user.
ru: Обязательный в случае, когда ok - False. Сообщение об ошибке, которое может прочитать человек, объясняющее причину, по которой бот не может обработать заказ (например "Извините, кто-то только что купил последнюю из наших прекрасных черных футболок с коротким рукавом пока вы заполняли детали оплаты. Пожалуйста выберите другой цвет или фасон!"). Telegram покажет это сообщение пользователю.

source: Asks for an answer to a shipping question.
ru: Запрашивает ответ на вопрос о доставке.

source: Telegram documentation: https://core.telegram.org/bots/api#answershippingquery
ru: Документация Telegram: https://core.telegram.org/bots/api#answershippingquery

source: Specify True if delivery to the specified address is possible and False if there are any problems (for example, if delivery to the specified address is not possible)
ru: Задайте True если доставка по выбранному адресу возможна и False, если есть какие-то проблемы (например, доставка по выбранному адресу не осуществляется)

source: Required if ok is True. A JSON-serialized array of available shipping options.
ru: Обязательный в случае, когда ok - True. Массив вариантов доставки в формате JSON.

source: Required if ok is False. Error message in human readable form that explains why it is impossible to complete the order (e.g. "Sorry, delivery to your desired address is unavailable'). Telegram will display this message to the user.
ru: Обязательный в случае, когда ok - False. Сообщение об ошибке, которое может прочитать человек, объясняющее причину, по которой невозможно завершить заказ (например "Извините, доставка по запрошенному адресу недоступна"). Telegram покажет это сообщение пользователю.

source: Use this method to set the result of an interaction with a Web App and send a corresponding message on behalf of the user to the chat from which the query originated. On success, a SentWebAppMessage object is returned.
ru: Используйте этот метод, чтобы задать результат взаимодействия с Web App и отправить соответствующее сообщение от лица пользователя в чат, из которого пришел запрос. В случае успеха возвращается объект SentWebAppMessage.

source: Telegram Documentation: https://core.telegram.org/bots/api#answerwebappquery
ru: Документация Telegram: https://core.telegram.org/bots/api#answerwebappquery

source: A JSON-serialized object describing the message to be sent
ru: Объект в формате JSON, описывающий сообщение, которое нужно отправить

source: On success, a SentWebAppMessage object is returned.
ru: В случае успеха возвращается объект SentWebAppMessage.

source: Use this method to approve a chat join request. The bot must be an administrator in the chat for this to work and must have the can_invite_users administrator right. Returns True on success.
ru: Используйте этот метод, чтобы одобрить запрос на вступление в чат. Бот должен быть администратором чата и иметь права администратора can_invite_users. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#approvechatjoinrequest
ru: Документация Telegram: https://core.telegram.org/bots/api#approvechatjoinrequest

source: Unique identifier for the target chat or username of the target supergroup (in the format @supergroupusername)
ru: Уникальный id чата или username супергруппы (в формате @supergroupusername)

source: Unique identifier of the target user
ru: Уникальный id сделавшего запрос пользователя

source: True on success.
ru: True в случае успеха.

source: Use this method to ban a user in a group, a supergroup or a channel. In the case of supergroups and channels, the user will not be able to return to the chat on their own using invite links, etc., unless unbanned first. Returns True on success.
ru: Используйте этот метод, чтобы заблокировать пользователя в группе, супергруппе или канале. В случае супергрупп и каналов, пользователь не сможет вернуться в чат самостоятельно, используя ссылки с приглашением и т.д., пока не будет разблокирован. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#banchatmember
ru: Документация Telegram: https://core.telegram.org/bots/api#banchatmember

source: Unique identifier for the target group or username of the target supergroup or channel (in the format @channelusername)
ru: Уникальный id группы или username супергруппы или канала (в формате @channelusername)

source: Date when the user will be unbanned, unix time. If user is banned for more than 366 days or less than 30 seconds from the current time they are considered to be banned forever
ru: Дата, когда пользователь будет разблокирован, в формате UNIX time. Если пользователь заблокирован больше чем на 366 дней или меньше чем на 30 секунд, то он будет заблокирован до ручной разблокировки

source: Bool: Pass True to delete all messages from the chat for the user that is being removed. If False, the user will be able to see messages in the group that were sent before the user was removed. Always True for supergroups and channels.
ru: Bool: Передайте True, чтобы удалить все сообщения пользователя из чата. Если False, пользователю будут доступны все сообщения в группе, отправленные до его блокировки. Всегда True для супергрупп и каналов.

source: Returns True on success.
ru: Возвращает True в случае успеха.

source: Use this method to ban a channel chat in a supergroup or a channel. The owner of the chat will not be able to send messages and join live streams on behalf of the chat, unless it is unbanned first. The bot must be an administrator in the supergroup or channel for this to work and must have the appropriate administrator rights. Returns True on success.
ru: Используйте этот метод, чтобы заблокировать канал в супергруппе или канале. Владелец канала не сможет отправлять сообщения и участвовать в прямых эфирах от лица канала, пока канал не будет разблокирован. Бот должен быть администратором супергруппы или канала и иметь соответствующие права администратора.Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#banchatsenderchat
ru: Документация Telegram: https://core.telegram.org/bots/api#banchatsenderchat

source: Unique identifier for the target chat or username of the target channel (in the format @channelusername)
ru: Уникальный id чата или username канала (в формате @channelusername)

source: Unique identifier of the target sender chat
ru: Уникальный id канала для блокировки

source: Handles new incoming callback query. As a parameter to the decorator function, it passes :class:`telebot.types.CallbackQuery` object.
ru: Обрабатывает новый callback запрос. В качестве параметра передаёт в декорируемую функцию объект :class:`telebot.types.CallbackQuery`.

source: Function executed as a filter
ru: Функция, используемая в качестве фильтра

source: Optional keyword arguments(custom filters)
ru: Необязательные именованные аргументы(кастомные фильтры)

source: Handles new incoming channel post of any kind - text, photo, sticker, etc. As a parameter to the decorator function, it passes :class:`telebot.types.Message` object.
ru: Обрабатывает новый пост любого типа в канале - текст, фото, стикер и т.д. В качестве параметра передаёт в декорируемую функцию объект :class:`telebot.types.Message`.

source: Optional list of strings (commands to handle).
ru: Необязательный список строк - команд для обработки.

source: Optional regular expression.
ru: Необязательное регулярное выражение.

source: Supported message content types. Must be a list. Defaults to ['text'].
ru: Обрабатываемые виды контента. Обязан быть списком. По умолчанию ['text']

source: Handles a request to join the chat has been sent. The bot must have the can_invite_users administrator right in the chat to receive these updates. As a parameter to the decorator function, it passes :class:`telebot.types.ChatJoinRequest` object.
ru: Обрабатывает запрос на вступление в чат. Бот должен иметь права администратора can_invite_users в чате, чтобы получать такие апдейты. В качестве параметра передаёт в декорируемую функцию объект :class:`telebot.types.ChatJoinRequest`.

source: Handles update in a status of a user in a chat. The bot must be an administrator in the chat and must explicitly specify “chat_member” in the list of allowed_updates to receive these updates. As a parameter to the decorator function, it passes :class:`telebot.types.ChatMemberUpdated` object.
ru: Обрабатывает изменение статуса пользователя в чате. Бот должен быть администратором чата и явно указать “chat_member“ в allowed_updates, чтобы получать такие апдейты. В качестве параметра передаёт в декорируемую функцию объект :class:`telebot.types.ChatMemberUpdated`.

source: The result of an inline query that was chosen by a user and sent to their chat partner. Please see our documentation on the feedback collecting for details on how to enable these updates for your bot. As a parameter to the decorator function, it passes :class:`telebot.types.ChosenInlineResult` object.
ru: Обрабатывает результат inline запроса, который был выбран пользователем и отправлен собеседнику в чате. Пожалуйста ознакомьтесь с документацией по сбору фидбека для получения таких апдейтов вашим ботом. В качестве параметра передаёт в декорируемую функцию объект :class:`telebot.types.ChosenInlineResult`.

source: Use this method to close the bot instance before moving it from one local server to another. You need to delete the webhook before calling this method to ensure that the bot isn't launched again after server restart. The method will return error 429 in the first 10 minutes after the bot is launched. Returns True on success.
ru: Используйте этот метод чтобы закрыть инстанс бота прежде чем перемещать его с одного локального сервера на другой. Вы должны удалить вебхук перед вызовом этого метода, чтобы убедиться. что бот не будет запущен повторно после перезапуска сервера. Метод будет возвращать ошибку 429 в течение 10 минут после запуска бота. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#close
ru: Документация Telegram: https://core.telegram.org/bots/api#close

source: Use this method to close an open topic in a forum supergroup chat. The bot must be an administrator in the chat for this to work and must have the can_manage_topics administrator rights, unless it is the creator of the topic. Returns True on success.
ru: Используйте этот метод, чтобы закрыть открытый топик в чате супергруппы. Бот должен быть администратором чата и иметь права администратора can_manage_topics, за исключением случаев, когда бот является создателем топика. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#closeforumtopic
ru: Документация Telegram: https://core.telegram.org/bots/api#closeforumtopic

source: Identifier of the topic to close
ru: id топика для закрытия

source: Use this method to close the 'General' topic in a forum supergroup chat. The bot must be an administrator in the chat for this to work and must have can_manage_topics administrator rights. Returns True on success.
ru: Используйте этот метод, чтобы закрыть открытый топик в чате супергруппы. Бот должен быть администратором чата и иметь права администратора can_manage_topics, за исключением случаев, когда бот является создателем топика. Возвращает True в случае успеха.

source: Telegram documentation: https://core.telegram.org/bots/api#closegeneralforumtopic
ru: Документация Telegram: https://core.telegram.org/bots/api#closeforumtopic

source: Closes existing session of aiohttp. Use this function if you stop polling/webhooks.
ru: Закрывает текущую aiohttp сессию. Используйте эту функцию для завершения работы поллинга или вебхука.

source: Use this method to copy messages of any kind.
ru: Используйте этот метод для копирования любых сообщений.

source: Telegram documentation: https://core.telegram.org/bots/api#copymessage
ru: Документация Telegram: https://core.telegram.org/bots/api#copymessage

source: Unique identifier for the chat where the original message was sent (or channel username in the format @channelusername)
ru: Уникальный id чата, в который было отправлено исходное сообщение (или username канала в формате @channelusername)

source: Message identifier in the chat specified in from_chat_id
ru: id сообщения в чате, заданном в from_chat_id

source: New caption for media, 0-1024 characters after entities parsing. If not specified, the original caption is kept
ru: Новая подпись для медиа, 0-1024 символа после форматирования. Если не задано, используется исходная подпись

source: Mode for parsing entities in the new caption.
ru: Режим форматирования новой подписи.

source: A JSON-serialized list of special entities that appear in the new caption, which can be specified instead of parse_mode
ru: Список отформатированных частей новой подписи в формате JSON, можно использовать вместо parse_mode
