Repository: eternnoir/pyTelegramBotAPI
Catalog: docs/source/locales/*/LC_MESSAGES/util.po
Languages: ru

source: Utils
ru: Утилиты

source: Utils in pyTelegramBotAPI
ru: Утилиты в pyTelegramBotAPI

source: ptba, pytba, pyTelegramBotAPI, utils, guide
ru: ptba, pytba, pyTelegramBotAPI, утилиты, гайд

source: util file
ru: Файл util

source: Use this function inside loops in order to avoid getting TooManyRequests error. Example:
ru: Используйте эту функцию в циклах, чтобы избежать ошибки TooManyRequests. Пример:

source: The function to call
ru: Вызываемая функция

source: The arguments to pass to the function
ru: Аргументы, для передачи в функцию

source: The keyword arguments to pass to the function
ru: Именованные аргументы для передачи в функцию

source: Yield successive n-sized chunks from lst.
ru: Генерирует последовательные части списка, состоящие из n элементов.

source: Contains all media content types.
ru: Содержит все виды медиа.

source: Contains all service content types such as `User joined the group`.
ru: Содержит все виды сервисных сообщений, такие как `User joined the group`.

source: Replaces the following chars in `text` ('&' with '&amp;', '<' with '&lt;' and '>' with '&gt;').
ru: Заменяет следующие символы в `text` ('&' на '&amp;', '<' на '&lt;' и '>' на '&gt;').

source: the text to escape
ru: Текст для замены символов

source: the escaped text
ru: Отформатированный текст

source: Returns the argument after the command.
ru: Возвращает аргументы команды.

source: Examples:
ru: Примеры:

source: String to extract the arguments from a command
ru: Строка для извлечения аргументов команды

source: the arguments if `text` is a command (according to is_command), else None.
ru: Аргументы, если `text` является командой (согласно is_command), в остальных случаях None.

source: :obj:`str` or :obj:`None`
ru: :obj:`str` или :obj:`None`

source: Extracts the command from `text` (minus the '/') if `text` is a command (see is_command). If `text` is not a command, this function returns None.
ru: Извлекает команду из `text` (исключает '/') если `text` является командой (см. is_command). Если `text` не является командой, эта функция возвращает None.

source: String to extract the command from
ru: Строка, из которой нужно извлечь команду

source: the command if `text` is a command (according to is_command), else None.
ru: Команда, если `text` является командой (согласно is_command), в остальных случаях None.

source: Generates a random token consisting of letters and digits, 16 characters long.
ru: Генерирует рандомный токен, состоящий из латинских букв и цифр длиной 16 символов.

source: a random token
ru: Сгенерированный токен

source: Returns True if the given object is a bytes object.
ru: Возвращает True если полученный объект является bytes.

source: object to be checked
ru: Объект для проверки

source: True if the given object is a bytes object.
ru: True, если полученный объект является bytes.

source: Checks if `text` is a command. Telegram chat commands start with the '/' character.
ru: Проверяет, является ли `text` командой. Команды в Telegram начинаются с символа '/'.

source: Text to check.
ru: Текст для проверки.

source: True if `text` is a command, else False.
ru: True, если `text` является командой, иначе False.

source: Returns True if the given object is a dictionary.
ru: Возвращает True, если полученный объект является словарём (dict).

source: True if the given object is a dictionary.
ru: True, если полученный объект является словарём (dict).

source: Returns True if the given object is a PIL.Image.Image object.
ru: Возвращает True, если полученный объект является PIL.Image.Image.

source: True if the given object is a PIL.Image.Image object.
ru: True, если полученный объект является PIL.Image.Image.

source: Returns True if the given object is a string.
ru: Возвращает True, если полученный объект является строкой (str).

source: Parses web app data.
ru: Обрабатывает данные, полученные от web app.

source: The bot token
ru: Токен бота

source: The raw init data
ru: Необработанные данные

source: The parsed init data
ru: Обработанные данные

source: Returns a reply markup from a dict in this format: {'text': kwargs} This is useful to avoid always typing 'btn1 = InlineKeyboardButton(...)' 'btn2 = InlineKeyboardButton(...)'
ru: Возвращает reply markup из словаря следующего формата: {'text': kwargs}. Удобно использовать вместо постоянного использования 'btn1 = InlineKeyboardButton(...)' 'btn2 = InlineKeyboardButton(...)'

source: Example:
ru: Пример:

source: Using quick_markup:
ru: Используя quick_markup:

source: a dict containing all buttons to create in this format: {text: kwargs} {str:}
ru: Словарь, содержащий все кнопки для создания reply markup в следующем формате: {text: kwargs} {str:}

source: Splits one string into multiple strings, with a maximum amount of `chars_per_string` characters per string. This is very useful for splitting one giant message into multiples. If `chars_per_string` > 4096: `chars_per_string` = 4096. Splits by '\n', '. ' or ' ' in exactly this priority.
ru: Разбивает строку на несколько, каждая из которых будет не длиннее `characters_per_string`. Удобно использовать для разбиения одного гигантского сообщения на несколько. Если `chars_per_string` > 4096: `chars_per_string` = 4096. Разбивает строку по '\n', '. ' или ' ' именно в таком порядке.

source: The text to split
ru: Текст для разбиения

source: The number of maximum characters per part the text is split to.
ru: Максимальное количество символов в части текста, на которые он будет разбит.

source: The splitted text as a list of strings.
ru: Список частей разбитого текста.

source: Splits one string into multiple strings, with a maximum amount of `chars_per_string` characters per string. This is very useful for splitting one giant message into multiples.
ru: Разбивает одну строку на несколько, каждая из которых будет не длиннее `characters_per_string`. Удобно использовать для разбиения одного гигантского сообщения на несколько.

source: The number of characters per line the text is split into.
ru: Количество символов в одной строке, на которые будет разбит текст.

source: All update types, should be used for allowed_updates parameter in polling.
ru: Все виды апдейтов, рекомендуется использовать в качестве параметра allowed_updates функции polling.

source: Returns an HTML user link. This is useful for reports. Attention: Don't forget to set parse_mode to 'HTML'!
ru: Возвращает HTML ссылку на пользователя. Удобно использовать для отчетов. Важно: Не забудьте установить значение 'HTML' в parse_mode!

source: You can use formatting.* for all other formatting options(bold, italic, links, and etc.) This method is kept for backward compatibility, and it is recommended to use formatting.* for more options.
ru: Вы можете использовать formatting.* во всех остальных вариантах форматирования(bold, italic, links, и прочее). Этот метод сохранён для обратной совместимости, рекомендуется использовать formatting.* для большего количества вариантов.

source: the user (not the user_id)
ru: Пользователь (не id пользователя)

source: include the user_id
ru: Добавить id пользователя

source: HTML user link
ru: Ссылка на пользователя в формате HTML

source: Validates web app data.
ru: Проверяет данные, полученные от web app.

source: A webhook endpoint for Google Cloud Functions FaaS.
ru: Endpoint вебхука для Google Cloud Functions FaaS.

source: The bot instance
ru: Инстанс бота

source: The request object
ru: HTTP-запрос

source: The response object
ru: Объект, полученный в качестве ответа
